{"_meta":{"is_edited":true,"retrieved_2nd_on":1725338878},"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"Hollande_Uranus","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_k9w2x9ba","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1725209269,"created_utc":1725209269,"discussion_type":null,"distinguished":null,"domain":"self.iwanttorun","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1f6j0tq","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"likes":null,"link_flair_background_color":"#46d160","link_flair_css_class":"","link_flair_richtext":[{"e":"text","t":"分享帖"}],"link_flair_template_id":"523fae80-a4bb-11ec-a57d-2a79825b6cd4","link_flair_text":"分享帖","link_flair_text_color":"dark","link_flair_type":"richtext","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1f6j0tq","no_follow":true,"num_comments":29,"num_crossposts":0,"num_reports":null,"over_18":false,"parent_whitelist_status":null,"permalink":"/r/iwanttorun/comments/1f6j0tq/日记_星际穿越篇_第1篇章/","pinned":false,"pwls":null,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"retrieved_on":1725209285,"saved":false,"score":21,"secure_media":null,"secure_media_embed":{},"selftext":"巴黎时间2024年9月1日。在此以日记的形式公开地记录，前人应该没有尝试过的移民路径。写本文时，距离我已经润出国门已有2年多之久。随着我对外界移民行情认知的逐渐加深，我的心情也变得比较复杂。写星际穿越篇系列日记的目的之一是，使具有参考性的日记日后能给别人带来帮助。按理说我应该在刚出国的时候就应记录这些。我选择现在开始记录，是因为在掌握足够多的信息之后，我有预感事情会生变。相信我，信息是最重要的，一艘宇宙飞船朝哪个方向飞行取决于它收集到的信息。\n\n我之前发现的中国的那个环境对人们的洗脑主要体现在3个方面：政治、英语、移民。不知你们有没有发现，生活在欺骗交织的世界中的中国人对这3点有着与事实完全不一样的认知。政治这一点不用说。英语方面，则是中国的教学方式侧重点不明，这样教学很容易让人学不会英语。如果没有语言天赋，或如果家长自己不懂如何学英语，那么小孩的英语很难学到能靠留学润的门槛。虽然我高考英语有130多分，但这只是听话多做题得到的成绩，当时我对熟练掌握英语毫无概念，我是考研英语一学不会不得已去学雅思的，就算后来能看懂考研英语一的文章大致上在讲什么，突然切换到雅思阅读，那感觉和看法语一样，完全不知道面前的那一坨是什么。雅思长时间总分一直蒙个5.0，得益于后来一对一辅导的突然开窍，加上受益于中共满世界放病毒造成的疫情，导致我申请的爱尔兰硕士允许使用多邻国语言成绩申请，这才刚考够其语言班的最低门槛，没有受制于短板，来到了境外。移民方面，有许多中国人盯着澳大利亚和加拿大，以为传统移民国家好留，以为非移民国家 = 无法移民的国家。事实上非移民国家的意思是，不是由移民组成的国家，这和移民难度没啥关系。我到后来好不容易确认，欧洲大部分国家是只要找到工作就基本上解决了身份，这和加拿大澳大利亚找到工作仅仅是移民游戏的开始完全不同，我本以为发现这一点，认知上就甩开绝大多数人，而来到境外后才发觉，印度等国家的人却早已知道，带上母国多年工作经验，保证该经验契合欧美公司Senior岗的招人要求，他们来到欧洲后甚至连硕士都不读，一个语言班挂靠过去接着投Senior岗就行了然后就能移民。只能说简体中文信息太多画饼宰杀人的骗局，当初不会连外网时，识破这个骗局花了我很长的时间。当然识破共产党也花了我很长时间，这个过程打比方说就像是，在逃离信息黑洞中心时，有一层接一层球体包围，每一层球体表面意味着每一层的巨量涉嫌洗脑的真假难辨的信息，在球体表面的巨量信息里找到漏洞才能前往更外层。有时一层是多层重叠的，需要同时盯住重叠层的多个内层漏洞，当这些漏洞形成通道时，才能打通重叠层的漏洞前往更外层，最终才得已摆脱中共洗脑。我的本科是在10043度过的，最终它对我的洗脑也以失败告终。\n\n但直到爱尔兰硕士毕业找工作时，我才发现了中国的那个环境对人们的洗脑还存在第4个方面：学制。也就是说那个环境总共从4个方面对中国人执行洗脑：政治、英语、移民、学制。其中移民和其他3个方面都分别有关系。此处要说的是学制对移民的影响。经过反复对比和推理，我认为，西方国家的学制是正常的，中国的学制是有问题的。在西方国家的大学里，盛行的是刷实习的氛围，期间只要有1个实习给转个正，就免于毕业前后疯狂投简历；而在中国的大学里，盛行的却是不必要的内卷，比如盛行考研、卷保研直博等，光我了解到的我家周围就有不少当年的同学后来都选择了读博。还有就是搞应届生制度。中国大部分公司都是黑企，它们往往喜欢单独设置应届生毕业时间范围，这样就能牢牢控制这一批接一批的新毕业生。这样一比不难发现，中国的应届生求职更像西方国家大学的多阶段投实习而不是西方国家大学毕业后投全职，后者更具有社招属性，往往需要实习经验，既然都实习了最好接着转正，何必到最后抢巨难进的新毕业生全职岗？中国是一个人人相互算计的社会，学校催促学生考研是为了学校自己的利益考虑，刷实习这种有利于就业的事情反而是知道这件事的学生会守口如瓶不会分享。再加上从学制角度考虑，本科阶段往往不安排实习，硕士阶段导师喜欢不放学生出去实习，进一步弱化学生对大公司实习重要性的认知，西方国家流行的实习转正概念就不会浮现在中国学生的脑海里。\n\n认识西方国家的同学是很有帮助的事。我是学EE的，这一行的求职我得到了不少来自西方国家同学的支援。ADI是爱尔兰疯狂招人的半导体大厂，美企，它的技术面主要考数电、Verilog数字系统设计和模电。在国内学EE的学生，高考录取时就搞专业细分，造成他们很有可能没有学到Verilog数字系统设计。还有模电，就算学了那也是基于电流控制的而不是西方国家的基于电压控制的，如果在中国读大三没有出国交换的话，将来参加EE技术面很容易出事。在爱尔兰硕士毕业后的1年当中，我在西方国家同学的帮助下，努力补了Verilog数字系统设计，并从教授那获得了视频等教学资源努力补了模电，本以为要在技术面大显身手，现实给我上了一课。那就是，没有实习，没有技术面。在爱尔兰的ADI不搞嘘寒问暖的初面，直接就是技术面。我给ADI投过去很多岗位，其中有50多个是毕业生技术岗，但是没有一个给我面试机会。我意识到这一点时是在2024年3月中旬，我通过西方国家学生的求职经历判断，之前秋季冬季投简历再怎么晚，也不该拖到3月中旬还是没有动静。我在2024年3月时判断应该就是没有实习造成的，但我在2023年10月投过Qorvo的实习岗，在当时投的时候才发现，实习必须在校生才可以做，毕业后不能做，他们本想给我面试的，结果后来整理简历时发现我已经毕业了，就把实习面试撤回了。我记得当时Qorvo官网上在爱尔兰的分部只有实习的机会，毕业生岗一个都没有，这也印证了这些公司更想要实习转正的学生而不是选择以毕业生岗的形式投放出去。2024年3月份，我又经历了思想风暴，不停地吞噬大量的信息，反复挖掘当前困境的突破口，在经历了一周后才慢慢找出来了应对举措。\n\n我当时首先想的是，如何恢复在校生身份，搞一个实习出来。首先想的是在爱尔兰随便读一个硕士恢复在校生，后期实习转正后退学。但是这个国家的学费比较贵，重启最低也需要15000欧元，就算最后通过实习转正了，之前旷课太多造成退学，也不知道学费拖着不交会面临什么样的后果，因此这个方案被排除了。于是我就考虑其他国家。我想到了法国，因为我记得法国可以直接读L3，也就是3年制本科的最后1年。我在浏览巴黎萨克雷大学时，发现它对专业的介绍是分M1和M2的，当时我就大胆做出猜测，能不能直接申请M2。发邮件问，对方回复我，可以。心里顿时挺激动的，因为与此同时我还发现，法国大部分M2都带有强制实习。于是开始研究登陆法国的事宜。当时我还因为一件事吓出来了一身冷汗。我在研究登陆法国时发现，如果我当初是在英国留学读一年制硕士，就会属于法国校园程序，学签申请会在1月左右就截止。有些大学或工程师学院的M2会把录取面试安排在6月进行，这意味着如果我在英国留学，申请这些项目再申请学签时间上无法实现。幸亏我在爱尔兰。法国学签申请不需要申请信和留学计划，这意味着法国学签不看申请人有没有移民倾向，但必须提供住宿证明。后来我的飞机抵达巴黎时，下飞机直接就是登机大厅，出海关时居然没有检查，登机大厅和外面马路直接相连没有安检，这个国家的包容惊呆了我。\n\n我习惯把3年制本科读完后的那2年制硕士和4年制本科在读最后一年的学生的领英经历整理出来进行信息提取。在2024年夏季，我发现了一个惊人的信息。那些4年制本科在读学生，在他们的大三暑期时几乎都去了一个位于爱尔兰科克的叫Tyndall National Institute的机构实习，其中不乏很多GPA极高但仍旧选择本地升硕的学神，当然这些人硕士期间找的实习都是大公司的并有很多人通过实习拿到了转正，以及后来申请到哥伦比亚大学EE的学霸。这个现象和我之前意识到的需要靠实习转正的认知违背，因为Tyndall National Institute这种地方只能积累实习经历，无法转正，虽然我通过多个外国同学的经历基本上确定，靠Tyndall National Institute的实习经历，就能拿到ADI的技术面。我经过仔细推敲后，发现了该如何解释这个现象，那就是投实习存在时间线，应该是从秋季开始投春暑实习，而不能是从春季开始投暑期实习。发现投实习存在时间线这件事非常非常重要，几乎直接决定了能否通过留学找到工作最终留在自由世界。南法有一所工程师学院的M2给我学费全免的奖学金，其课程质量也不错，虽然学校排名一般，但我还是接了它。我之前收到过巴黎萨克雷大学的M2，它还属于巴黎中央理工-高等电力学院这所排名十分靠前的工程师学院。我拒了它是因为它的课程我认为对就业没啥帮助，它课程最好的那个M2把我拒了，而我只是需要一个在校生身份。\n\n我现在要执行的计划是，把法国的学制优势安插在爱尔兰身上实现，因为我现在还有爱尔兰硕士给我的毕业身份Stamp 1G。它是一年一续，总共可以使用两年，我下次续该身份是在2024年12月中期。该计划执行成功的标志是，我需要确保在此之前获得来自爱尔兰的好运，否则我不会续该身份，而是暂时留在法国。我可以使用我在爱尔兰反贼朋友的地址，用于接收新的Stamp 1G居留卡。用毕业后获得的可用于打工的身份做在校生才能做的实习，听上去怪怪的，特别是考虑到这个在校生目前正在另一个国家。关于投实习，找工找这么长时间，我发现了更高效的办法，绕开领英，直接把那一堆目标公司的求职官网全部都提前打开，这里就需要用MacBook，不然用Windows经常关机开机，重新打开那一堆官网，这对求职很不方便。9月后每过一天我会挨个官网刷新新出现的实习机会，像机枪扫射一样地把简历投递过去。事情后来的进展我会在日记 - 星际穿越篇的后续篇章里描述，敬请期待。","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"iwanttorun","subreddit_id":"t5_42jf61","subreddit_name_prefixed":"r/iwanttorun","subreddit_subscribers":40488,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"日记 - 星际穿越篇 - 第1篇章","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":21,"upvote_ratio":0.8700000047683716,"url":"https://www.reddit.com/r/iwanttorun/comments/1f6j0tq/日记_星际穿越篇_第1篇章/","user_reports":[],"view_count":null,"visited":false,"whitelist_status":null,"wls":null}
