{"_meta":{"retrieved_2nd_on":1732038452},"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"Laffei","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_3c3d2pm4","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1731908844,"created_utc":1731908844,"crosspost_parent":"t3_1diaccv","crosspost_parent_list":[{"all_awardings":[],"allow_live_comments":true,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"Prestigious_Trade986","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_a9loldan5","author_is_blocked":false,"author_patreon_flair":false,"author_premium":true,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1718661751,"created_utc":1718661751,"discussion_type":null,"distinguished":null,"domain":"self.self","downs":0,"edited":1730844861,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1diaccv","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"likes":null,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1diaccv","no_follow":false,"num_comments":2922,"num_crossposts":5,"num_reports":null,"over_18":false,"permalink":"/r/self/comments/1diaccv/as_an_america_of_asian_descent_i_am_experiencing/","pinned":false,"pwls":null,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"saved":false,"score":11988,"secure_media":null,"secure_media_embed":{},"selftext":"They assume I'm Chinese and don't know Japanese so they talk a crazy amount of shit next to me pretty much everywhere I go\n\nTokyo Station\n\nHe has the stink of a foreigner/Chinese (two teen girls said this three times as I passed by them looking for someone)\n\nOn a Train\n\nHe's scary/dangerous. Don't look at him.  He'll kill you (I'm as straight-laced as they come)\n\nHe's American.  He's still Chinese though (after hearing me speak English)\n\nTrain Station\n\nMy wife (who's born and raised Japanese) and I approach two male train station staff.  She asks them a question, looks at me quizzically wondering why I'm not the one asking, and answer her question.  I then ask them a question at the end and they just walk away and mutter to each other (what the hell is she doing with a foreigner.)\n\nTokyo Skytree\n\nThey come every damn year over and over\n\nIt's ok he's a foreigner (a teen to his friend when he sat down while half-asking if he could\n\nTokyo Disneyland\n\nYou shouldn't be here.  Get out of here (to my white Hispanic in-law, my sister also came)\n\nMt Takao\n\nHe has a huge backpack.  It's so lame.  I'd never wear that.  (Bought the backpack in Japan.  It's for my Japanese wife with rheumatoid arthritis and young daughter and me.)\n\nHow many pictures is she going to take?  She's taking another one!  (girl to guy about my sister taking pictures of the view on the train up to Mt Takao)\n\nForeigners are really a pain in the ass.   He ruined the vibe.  I don't know want to talk anymore.  We should've come earlier so we'd see fewer foreigners (after seeing me, various places)\n\nHe's pushing that little girl.  She looks Japanese.  Is that ok? (Im walking and holding hands with my daughter)\n\nI'm going the wrong way haha (a group taking up the entire path including my left side)\n\nHe's getting scared.  He'll start shaking soon (buying tickets at a machine and having a bit of trouble before our Japanese guide came looking like he was embarrassed to be with us.)\n\nA word about our guide: My wife and child weren't on this trip to Mt Takao with us as they were visiting family.  Later our guide said I should've told them I had a Japanese wife and child as if that would've made us acceptable in his eyes.  And he did start treating us better after he found that out.  He seems like a decent guy, it's a shame he only saw us as decent after finding we had Japanese family and friends)\n\nHakone\n\nWhat the hell is that Japanese man doing showing these foreigners around (about our guide, two young men a foot behind me at a ticket office)\n\nThere's foreigners here.  It's safe there's a Japanese man with them\n\nRest Stop on the Way Back\n\nHe's not Japanese.  Look at his eyes (a mom said this to her ten yr old)\n\nKamakura\n\nForeigners love to stand in the middle of the road (we were to the side in an alley)\n\nComplaining about foreigners taking all the incense sticks at a shrine (we took two)\n\nBowing to me with clapped hands (thats a stereotypical Asian bow thet dont do) as I pass them on the street.  Yelling Korean at me (twice)\nThoughts: Visiting Japan has gotten much worse this year.  It's constantly being watched and policed and talked about and criticized and held to a higher standard than Japanese and feeling unwanted and Im imposing on their lives and the cause of whatever problem it is they're personally going through.  The people are seething underneath and it explodes in angry whispers.  Always whispers.  Apparently it's due to weakening yen, economy, low birth rate, China-Japan relations, poor communication skills, widespread media coverage of a few foreigners behaving badly.  \n\nThere are also cases where they've been nice, helping me pick up something Ive dropped, making small talk with a smile, hurrying to eat their food so my family could sit a little sooner.\n\nI am trying to concentrate on positive experiences and am still having fun but I am also feeling increasingly insecure out in public and emotionally exhausted\n\nUpdate 1: \n6/18 Tokyo Station, Ginza, Akihabara, Skytree\n\nWhat's she doing with a foreigner.  He has to be chinese right.  But he can speak japanese.  Maybe he's Japanese American.  But he looks Chinese.  I guess with some women any one is ok.  She should be with Japanese man though.  Their daughter is speaking English and Japanese.  She should learn more Japanese. Now he's speaking English again.  Well maybe he's a nice guy.  There's bad japanese guys too.  (Two older women having a running conversation one table away in a tiny restaurant)\n\nIt smells (two teen girls with their dad when they see me)\n\nIt's lame with foreigners here (at a restaurant)\n(After hearing me speak english.) He cant be chinese of course because he has facial hair so he's american.  Wow you know so much about them.  Well i guess you could say that\n\nThat's why I couldn't figure out what he was.  (After interacting with me then seeing my wife)\n\nHold me tighter.  He's so scary (my 70 year old dad and I walking)\n\n(After i put on an american flag sticker on my backpack)\n\nLook at him total giveaway, chinese.  Ah, he's american\n\nHes chinese right.  Ah wrong, american\n\nThere's another one.  Ah it's because japanese are too annoying he got the flag\n\nSo he's american. But he's still conniving to put that flag there\n\nThoughts: Reading everyone's comments has been really validating and perspective-shifting and helpful to me.  Thank you all for your support!  Only eleven more days to go this time in Hokkaido.  While I've had some incidents there in the past (family friend said Chinese bring pests with them, airport workers tried to figure out what I was for twenty or so minutes while I waited to enter the gate) hopefully there will be less incidents since there are fewer tourists and I'll be around my wife and her father more instead of on my own or with my extended family\n\nUpdate 2: \n \n6/19 At the Airport, Hokkaido\n\nHe's a foreigner.  American.  But Chinese probably.  His wife's Japnese.  But theyre sometimes speaking English.  They should teach their daughter Japanese.  There are Japanese who travel overseas.  That's probably where they met.  We should talk later.  He might know Japanese.  (At a restaurant, the baggage handlers behind the staff at the ticket counter, on the airplane.  Pretty much same conversation.  After i started speaking more than a little japnese the men at the restaurant stopped talking about us.)\n\nHe's a foreigner.  I guess Japanese girls are that good.  Quiet, he might know some Japanese (group of Japanese boys)\n\nYou know from ancient times Japan's been in charge of China.  That's terrible you said that.  It's the Chinese again (At the airport restroom behind my back while I was peeing, his friend, then same guy again at the parking lot while I was walking with my father in law)\n\nThey're letting foreign children in now (after saying hi to a mom with her toddler when signing my child up for elementary school)\n\nThoughts: years ago they might more considerately say \"he has the look of a foreigner\" or \"we can't really tell can we\" but recently it's with contempt and \"he has the stink of a foreigner\"\n\nUpdate 3:\n\n6/20 Tomita Farms\n\nYou know that guy he's not japanese hes chinese or american\n\nThis place is full of foreigners.  This country is over\n\nHey be nice to the foreigner.  This one knows Japanese and has manners (after another staff member must have said something)\n\n6/21 Asahikawa, zoo\n\nLeaving the seal exhibit, a man with teenaged kids said to them upon exiting and hearing me speak English \"japan is finished\"\n\nOn the bus out, an old lady mustve been over 80 said to her companion after hearing me speak english that don't foreigners have their own zoos to go to?  Why are they coming to our country to our zoos?\n\nThoughts: for the most part, the last two days I spent it with my wife and her family as we went out so most I got were looks and hey he's alright he's with a Japanese wife and them trying to figure out how an Asian could speak english. As long as Im in visual distance of Japanese I know where they can connect us the most they show is civility and curiosity.  I do think more than Tokyo the staff is also more used to Asian travelers and in fact want then to come because i dont sense so much fatigue and from what i heard the zoo and tomita farms and elsewhere spent lots of money to lure foreign tourists and there were quite a few.\n\n6/22\nAt a scenic view, bikers kept looking my way and made jokes among themselves but I couldn't make it out.\n\nAt a rest stop in a small town, one person saw I wasn't Japanese and talked about it then other groups overheard them talking then everyone was talking about the \"Chinese,\" \"how could she be with a Japanese,\"  \"They're probably eating fried rice tonight,\" \"he's stretching and Japanese don't stretch in public,\" \"look at his face hes not Japanese.\"  One group said it so loud my father-in-law overheard and muttered they were being rude and my wife looked at me finally understanding what I'd been telling her.\n\nFinal Update:\n\n6/23-7/1\n\nAt a mall, a couple walking behind me said I couldn't be Japanese because my legs were short\n\nAt a children's playground, another kid said to her friend \"let's go there's a weird kid speaking English here.\"\n\nAt a ramen shop, a woman with her boyfriend, both in late twenties, said my speaking English made her feel sick\n\nAt a sushi restaurant.  I was refilling hot tea for my wife and father in law and two Japanese young men were watching and said \"So he is considerate.  About this, anyway.\"  And left.\n\nAt another children's playground, the kids were playing run away from the foreigner\n\nAt the airport, a father pointed out to his pre-teen son that I wasn't Japanese as they walked past and the son then scoped me out.  Then a group of male teens were again surprised that I wasn't Japanese and speaking English\n\nAt LAX, two Japanese men there for the anime expo said \"oh he's a foreigner\" when they noticed me.\n\nThoughts: for the most part, went out with my wife and father-in-law so didn't hear as many comments on a per meeting basis.  I did overhear them say to \"be considerate.  He's with Japanese. It can't be helped.\"  I did hear the usual \"he's not Japanese, he's a foreigner, Chinese\" which I got accustomed to but it's the negative comments that got to me.  I think the only time I felt like things could turn to violence was at Mt Takao where the train we took down the mountain was full of rowdy men who had earlier criticized me for not being able to work the ticket machine faster.  \n\nMy takeaway from this experience is that the Japanese people are curious, they are also going to talk shit if they feel they can get away with it but I can't live my life by what people are thinking.  I can just try to be positive, hopefully that will help them change, and do what I need to do.  But also not to repeatedly put myself in a situation with people where I can't thrive.  Thanks to everyone for your support.  It really helped support me so I could figure how to deal with this incredible stress.","selftext_html":"<!-- SC_OFF --><div class=\"md\"><p>They assume I&#39;m Chinese and don&#39;t know Japanese so they talk a crazy amount of shit next to me pretty much everywhere I go</p>\n\n<p>Tokyo Station</p>\n\n<p>He has the stink of a foreigner/Chinese (two teen girls said this three times as I passed by them looking for someone)</p>\n\n<p>On a Train</p>\n\n<p>He&#39;s scary/dangerous. Don&#39;t look at him.  He&#39;ll kill you (I&#39;m as straight-laced as they come)</p>\n\n<p>He&#39;s American.  He&#39;s still Chinese though (after hearing me speak English)</p>\n\n<p>Train Station</p>\n\n<p>My wife (who&#39;s born and raised Japanese) and I approach two male train station staff.  She asks them a question, looks at me quizzically wondering why I&#39;m not the one asking, and answer her question.  I then ask them a question at the end and they just walk away and mutter to each other (what the hell is she doing with a foreigner.)</p>\n\n<p>Tokyo Skytree</p>\n\n<p>They come every damn year over and over</p>\n\n<p>It&#39;s ok he&#39;s a foreigner (a teen to his friend when he sat down while half-asking if he could</p>\n\n<p>Tokyo Disneyland</p>\n\n<p>You shouldn&#39;t be here.  Get out of here (to my white Hispanic in-law, my sister also came)</p>\n\n<p>Mt Takao</p>\n\n<p>He has a huge backpack.  It&#39;s so lame.  I&#39;d never wear that.  (Bought the backpack in Japan.  It&#39;s for my Japanese wife with rheumatoid arthritis and young daughter and me.)</p>\n\n<p>How many pictures is she going to take?  She&#39;s taking another one!  (girl to guy about my sister taking pictures of the view on the train up to Mt Takao)</p>\n\n<p>Foreigners are really a pain in the ass.   He ruined the vibe.  I don&#39;t know want to talk anymore.  We should&#39;ve come earlier so we&#39;d see fewer foreigners (after seeing me, various places)</p>\n\n<p>He&#39;s pushing that little girl.  She looks Japanese.  Is that ok? (Im walking and holding hands with my daughter)</p>\n\n<p>I&#39;m going the wrong way haha (a group taking up the entire path including my left side)</p>\n\n<p>He&#39;s getting scared.  He&#39;ll start shaking soon (buying tickets at a machine and having a bit of trouble before our Japanese guide came looking like he was embarrassed to be with us.)</p>\n\n<p>A word about our guide: My wife and child weren&#39;t on this trip to Mt Takao with us as they were visiting family.  Later our guide said I should&#39;ve told them I had a Japanese wife and child as if that would&#39;ve made us acceptable in his eyes.  And he did start treating us better after he found that out.  He seems like a decent guy, it&#39;s a shame he only saw us as decent after finding we had Japanese family and friends)</p>\n\n<p>Hakone</p>\n\n<p>What the hell is that Japanese man doing showing these foreigners around (about our guide, two young men a foot behind me at a ticket office)</p>\n\n<p>There&#39;s foreigners here.  It&#39;s safe there&#39;s a Japanese man with them</p>\n\n<p>Rest Stop on the Way Back</p>\n\n<p>He&#39;s not Japanese.  Look at his eyes (a mom said this to her ten yr old)</p>\n\n<p>Kamakura</p>\n\n<p>Foreigners love to stand in the middle of the road (we were to the side in an alley)</p>\n\n<p>Complaining about foreigners taking all the incense sticks at a shrine (we took two)</p>\n\n<p>Bowing to me with clapped hands (thats a stereotypical Asian bow thet dont do) as I pass them on the street.  Yelling Korean at me (twice)\nThoughts: Visiting Japan has gotten much worse this year.  It&#39;s constantly being watched and policed and talked about and criticized and held to a higher standard than Japanese and feeling unwanted and Im imposing on their lives and the cause of whatever problem it is they&#39;re personally going through.  The people are seething underneath and it explodes in angry whispers.  Always whispers.  Apparently it&#39;s due to weakening yen, economy, low birth rate, China-Japan relations, poor communication skills, widespread media coverage of a few foreigners behaving badly.  </p>\n\n<p>There are also cases where they&#39;ve been nice, helping me pick up something Ive dropped, making small talk with a smile, hurrying to eat their food so my family could sit a little sooner.</p>\n\n<p>I am trying to concentrate on positive experiences and am still having fun but I am also feeling increasingly insecure out in public and emotionally exhausted</p>\n\n<p>Update 1: \n6/18 Tokyo Station, Ginza, Akihabara, Skytree</p>\n\n<p>What&#39;s she doing with a foreigner.  He has to be chinese right.  But he can speak japanese.  Maybe he&#39;s Japanese American.  But he looks Chinese.  I guess with some women any one is ok.  She should be with Japanese man though.  Their daughter is speaking English and Japanese.  She should learn more Japanese. Now he&#39;s speaking English again.  Well maybe he&#39;s a nice guy.  There&#39;s bad japanese guys too.  (Two older women having a running conversation one table away in a tiny restaurant)</p>\n\n<p>It smells (two teen girls with their dad when they see me)</p>\n\n<p>It&#39;s lame with foreigners here (at a restaurant)\n(After hearing me speak english.) He cant be chinese of course because he has facial hair so he&#39;s american.  Wow you know so much about them.  Well i guess you could say that</p>\n\n<p>That&#39;s why I couldn&#39;t figure out what he was.  (After interacting with me then seeing my wife)</p>\n\n<p>Hold me tighter.  He&#39;s so scary (my 70 year old dad and I walking)</p>\n\n<p>(After i put on an american flag sticker on my backpack)</p>\n\n<p>Look at him total giveaway, chinese.  Ah, he&#39;s american</p>\n\n<p>Hes chinese right.  Ah wrong, american</p>\n\n<p>There&#39;s another one.  Ah it&#39;s because japanese are too annoying he got the flag</p>\n\n<p>So he&#39;s american. But he&#39;s still conniving to put that flag there</p>\n\n<p>Thoughts: Reading everyone&#39;s comments has been really validating and perspective-shifting and helpful to me.  Thank you all for your support!  Only eleven more days to go this time in Hokkaido.  While I&#39;ve had some incidents there in the past (family friend said Chinese bring pests with them, airport workers tried to figure out what I was for twenty or so minutes while I waited to enter the gate) hopefully there will be less incidents since there are fewer tourists and I&#39;ll be around my wife and her father more instead of on my own or with my extended family</p>\n\n<p>Update 2: </p>\n\n<p>6/19 At the Airport, Hokkaido</p>\n\n<p>He&#39;s a foreigner.  American.  But Chinese probably.  His wife&#39;s Japnese.  But theyre sometimes speaking English.  They should teach their daughter Japanese.  There are Japanese who travel overseas.  That&#39;s probably where they met.  We should talk later.  He might know Japanese.  (At a restaurant, the baggage handlers behind the staff at the ticket counter, on the airplane.  Pretty much same conversation.  After i started speaking more than a little japnese the men at the restaurant stopped talking about us.)</p>\n\n<p>He&#39;s a foreigner.  I guess Japanese girls are that good.  Quiet, he might know some Japanese (group of Japanese boys)</p>\n\n<p>You know from ancient times Japan&#39;s been in charge of China.  That&#39;s terrible you said that.  It&#39;s the Chinese again (At the airport restroom behind my back while I was peeing, his friend, then same guy again at the parking lot while I was walking with my father in law)</p>\n\n<p>They&#39;re letting foreign children in now (after saying hi to a mom with her toddler when signing my child up for elementary school)</p>\n\n<p>Thoughts: years ago they might more considerately say &quot;he has the look of a foreigner&quot; or &quot;we can&#39;t really tell can we&quot; but recently it&#39;s with contempt and &quot;he has the stink of a foreigner&quot;</p>\n\n<p>Update 3:</p>\n\n<p>6/20 Tomita Farms</p>\n\n<p>You know that guy he&#39;s not japanese hes chinese or american</p>\n\n<p>This place is full of foreigners.  This country is over</p>\n\n<p>Hey be nice to the foreigner.  This one knows Japanese and has manners (after another staff member must have said something)</p>\n\n<p>6/21 Asahikawa, zoo</p>\n\n<p>Leaving the seal exhibit, a man with teenaged kids said to them upon exiting and hearing me speak English &quot;japan is finished&quot;</p>\n\n<p>On the bus out, an old lady mustve been over 80 said to her companion after hearing me speak english that don&#39;t foreigners have their own zoos to go to?  Why are they coming to our country to our zoos?</p>\n\n<p>Thoughts: for the most part, the last two days I spent it with my wife and her family as we went out so most I got were looks and hey he&#39;s alright he&#39;s with a Japanese wife and them trying to figure out how an Asian could speak english. As long as Im in visual distance of Japanese I know where they can connect us the most they show is civility and curiosity.  I do think more than Tokyo the staff is also more used to Asian travelers and in fact want then to come because i dont sense so much fatigue and from what i heard the zoo and tomita farms and elsewhere spent lots of money to lure foreign tourists and there were quite a few.</p>\n\n<p>6/22\nAt a scenic view, bikers kept looking my way and made jokes among themselves but I couldn&#39;t make it out.</p>\n\n<p>At a rest stop in a small town, one person saw I wasn&#39;t Japanese and talked about it then other groups overheard them talking then everyone was talking about the &quot;Chinese,&quot; &quot;how could she be with a Japanese,&quot;  &quot;They&#39;re probably eating fried rice tonight,&quot; &quot;he&#39;s stretching and Japanese don&#39;t stretch in public,&quot; &quot;look at his face hes not Japanese.&quot;  One group said it so loud my father-in-law overheard and muttered they were being rude and my wife looked at me finally understanding what I&#39;d been telling her.</p>\n\n<p>Final Update:</p>\n\n<p>6/23-7/1</p>\n\n<p>At a mall, a couple walking behind me said I couldn&#39;t be Japanese because my legs were short</p>\n\n<p>At a children&#39;s playground, another kid said to her friend &quot;let&#39;s go there&#39;s a weird kid speaking English here.&quot;</p>\n\n<p>At a ramen shop, a woman with her boyfriend, both in late twenties, said my speaking English made her feel sick</p>\n\n<p>At a sushi restaurant.  I was refilling hot tea for my wife and father in law and two Japanese young men were watching and said &quot;So he is considerate.  About this, anyway.&quot;  And left.</p>\n\n<p>At another children&#39;s playground, the kids were playing run away from the foreigner</p>\n\n<p>At the airport, a father pointed out to his pre-teen son that I wasn&#39;t Japanese as they walked past and the son then scoped me out.  Then a group of male teens were again surprised that I wasn&#39;t Japanese and speaking English</p>\n\n<p>At LAX, two Japanese men there for the anime expo said &quot;oh he&#39;s a foreigner&quot; when they noticed me.</p>\n\n<p>Thoughts: for the most part, went out with my wife and father-in-law so didn&#39;t hear as many comments on a per meeting basis.  I did overhear them say to &quot;be considerate.  He&#39;s with Japanese. It can&#39;t be helped.&quot;  I did hear the usual &quot;he&#39;s not Japanese, he&#39;s a foreigner, Chinese&quot; which I got accustomed to but it&#39;s the negative comments that got to me.  I think the only time I felt like things could turn to violence was at Mt Takao where the train we took down the mountain was full of rowdy men who had earlier criticized me for not being able to work the ticket machine faster.  </p>\n\n<p>My takeaway from this experience is that the Japanese people are curious, they are also going to talk shit if they feel they can get away with it but I can&#39;t live my life by what people are thinking.  I can just try to be positive, hopefully that will help them change, and do what I need to do.  But also not to repeatedly put myself in a situation with people where I can&#39;t thrive.  Thanks to everyone for your support.  It really helped support me so I could figure how to deal with this incredible stress.</p>\n</div><!-- SC_ON -->","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"self","subreddit_id":"t5_2qh96","subreddit_name_prefixed":"r/self","subreddit_subscribers":1466344,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"As an America of Asian descent I am experiencing a crazy amount of racism in Japan","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":11988,"upvote_ratio":0.8899999856948853,"url":"https://www.reddit.com/r/self/comments/1diaccv/as_an_america_of_asian_descent_i_am_experiencing/","user_reports":[],"view_count":null,"visited":false,"wls":null}],"discussion_type":null,"distinguished":null,"domain":"","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1gtxyi7","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"likes":null,"link_flair_background_color":"#ffb000","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"835faabe-4934-11ee-b29f-ca636b24ccf4","link_flair_text":"🥱闲聊吹水","link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1gtxyi7","no_follow":true,"num_comments":43,"num_crossposts":0,"num_reports":null,"over_18":false,"permalink":"/r/runtoJapan/comments/1gtxyi7/洋大人该受歧视还是得受/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"retrieved_on":1731908861,"saved":false,"score":25,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"runtoJapan","subreddit_id":"t5_7eixzl","subreddit_name_prefixed":"r/runtoJapan","subreddit_subscribers":18282,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":null,"thumbnail_width":null,"title":"洋大人该受歧视还是得受","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":25,"upvote_ratio":0.7900000214576721,"url":"/r/self/comments/1diaccv/as_an_america_of_asian_descent_i_am_experiencing/","url_overridden_by_dest":"/r/self/comments/1diaccv/as_an_america_of_asian_descent_i_am_experiencing/","user_reports":[],"view_count":null,"visited":false,"wls":6}
