{"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"TimeLimitExceeeeded","author_flair_background_color":"#ffd635","author_flair_css_class":null,"author_flair_richtext":[{"e":"text","t":"准备跑路"}],"author_flair_template_id":"81e3ffee-7f4e-11eb-bb28-0eb89a5ff8a5","author_flair_text":"准备跑路","author_flair_text_color":"dark","author_flair_type":"richtext","author_fullname":"t2_a030uoef","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1684830406,"created_utc":1684830406,"crosspost_parent":"t3_10yysxt","crosspost_parent_list":[{"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"rcictoronto","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_bgza7cqd","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1676053027,"created_utc":1676053027,"discussion_type":null,"distinguished":null,"domain":"self.IWantOut","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10yysxt","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"likes":null,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_10yysxt","no_follow":false,"num_comments":71,"num_crossposts":1,"num_reports":null,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/IWantOut/comments/10yysxt/guide_canadian_immigration_in_2023_cowritten_by/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"saved":false,"score":171,"secure_media":null,"secure_media_embed":{},"selftext":"Canadian immigration has been a bit of a hot mess for the past couple of years. Programs we’ve grown to rely on are changing and getting more competitive and unpredictable, there is a massive backlog causing delays, Immigration (“IRCC”) are increasingly relying on AI, and we are seeing many generic and often unfair refusals for temporary visas. \n\nSo, we thought we’d give you a rundown of how Canadian immigration works these days, what to do if your application is delayed/refused, and a couple of insights along the way. We will be focusing on individual economic immigration. But feel free to ask about family immigration, refugee or humanitarian & compassionate options (please don’t ask about business because we don’t do that kind of work).\n\nHappy to answer any questions that we can 😊\n\nDISCLOSURE: This is a confusing time and we hope this post helps, especially if you're DIYing your immigration. But we are also licensed professionals, so if this post makes you want to look us up and book a consultation, we'd be happy to help. \n\n**Disclaimer:**\n\nThis guide contains some generalizations, as it is not possible to account for every scenario. You should not use it as an ultimate immigration guide, but merely as a starting point in your research.\n\n**Intro**  \n Canadian immigration programs tend to prioritize educated professionals with strong English and/or French skills, especially in the industries that are experiencing labour shortages, e.g. healthcare & IT. Canada also seeks to attract more French speakers, so if you speak both official languages or if your French is strong, you might have a slight advantage.\n\nCanada also offers numerous pathways to graduates of some Canadian post-secondary institutions. In general, Canadian education is very popular since immigration programs are getting more and more competitive every year, and a Canadian degree/diploma can tip the balance in your favour. However studying in Canada ≠ guaranteed immigration.\n\nIf you have a family member (most commonly, a spouse or a common-law partner or a parent, if you’re under 22), you may be able to immigrate through them. Other relatives usually cannot sponsor you, but in some cases they can slightly improve your chances of immigration.\n\nLastly, if you are already in Canada and have very unique and very compelling circumstances, and/or are facing danger if returned to your country of origin, you may be eligible for making a refugee claim\\* or immigration on humanitarian and compassionate grounds. This isn’t really an immigration pathway, it’s more of a last resort for people who are in complex and messy immigration situations.\n\n\\*There are exceptions to this, and some people can be resettled as refugees by UNHCR officer outside Canada, or sponsored by Canadians, but this post won’t cover these options.\n\n**So, let’s say you’re a regular professional without close family in Canada and not in any danger. There are two ways you can immigrate:**\n\n&#x200B;\n\n* Apply for      permanent residence from abroad and land in Canada as a permanent      resident. This process can take anywhere between 1-4 years (from the      moment you submit the application).\n* Come to Canada      as a worker/student to become eligible to apply for permanent residence      (PR) from inside Canada. This process usually takes a minimum of 1.5-2      years from the moment you land in Canada, usually longer.\n\nThe first option tends to be more difficult, since it usually requires the candidate to have one or more of the following:\n\na) A highly competitive profile, which can look like superior language skills in one or both of Canada’s official languages, years of skilled work experience, and post-secondary education at a high level (Bachelor’s degree and higher).\n\nb) Work experience in an in-demand profession.\n\nc) A Canadian employer willing to jump through lots of hoops and pay high fees to hire you.\n\nd) Strong connections to a specific province.\n\nd) Strong French skills.\n\nTherefore, many people opt for the second option, and come to Canada as workers, students, or sometimes even visitors, and subsequently become eligible for one of Canada’s immigration pathways.\n\nI will start with Option 1 and cover some Option 2 scenarios afterwards.\n\n**What immigration pathways are out there?**\n\n&#x200B;\n\n* Canada has      Federal, Provincial, and community-driven immigration programs. Federal programs      are more competitive. Provincial and community-driven programs tend to      have lower requirements but often require that the individual has      connections to the province/community. The connections usually need to be      in form of work or studies in the province/community or a job offer.      However, sometimes having relatives, friends, or having visited the      province/community can be enough.\n* Most Canadian      immigration pathways are point-based, which means you are assigned points      based on your age, education, work experience, connections to Canada,      language skills, etc. So, even if you read program requirements and you      think that you meet the minimum eligibility criteria – that does not      necessarily mean that you can realistically immigrate through the program      of your choice. \n* Temporary      pathways. Sometimes Canada creates new temporary pathways to meet its      immigration goals. E.g. TR to PR during Covid, a pathway for out-of-status      construction workers. If it sounds too good to be true, double-check, it      may no longer be valid. \n\n**Express Entry (EE)**\n\n**Disclaimer:** EE is probably what most people know when it comes to Canadian immigration. However, this year (2023) the system will be undergoing significant changes and it will favour candidates in in-demand occupations and potentially candidates with Canadian education/work experience. What are those occupations? We don’t know yet. Do I think you should still consider this pathway? Absolutely. \n\nEE is a Federal Immigration system that manages intake into 3 immigration programs: [Federal Skilled Worker](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html)(FSW), [Canadian Experience Class](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html) (CEC), and [Federal Skilled Trades](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html) (FST). In addition to that, there are some Provincial Immigration programs that are processed through Express Entry. I would normally suggest that people look at EE as a starting point, but it has become increasingly competitive over the years. \n\n**How does EE work?**\n\n&#x200B;\n\n1. Read the      eligibility requirements for the 3 programs and confirm that you are      eligible for at least one of them.\n2. Write an [immigration-approved      English/French test](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/documents/language-requirements/language-testing.html) and have your highest Educational      Credential assessed by a [designated      organization](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/documents/education-assessed/how.html).\n3. Create a      free [online      profile](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/submit-profile.html).\n4. Get an      invitation to apply (if you are amongst the highest scoring candidates or      a province nominates you).\n5. Submit an      application for permanent residence.\n\n**How do you know if your profile is competitive for any programs managed through Express Entry?**\n\nThese are the steps:\n\n&#x200B;\n\n1. Calculate your      score using the [online      tool:](https://www.cic.gc.ca/english/immigrate/skilled/crs-tool.asp)\n2. Check [scores](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/express-entry-rounds.html) under      your program or “No program specified” and see where you stand. Right now      scores are pretty high, but before COVID-19 they were in 470s. There were      some crazy low scores in 2021 as the government were trying really hard to      hit their immigration objectives, but I wouldn’t expect it to go this low      in the foreseeable future. \n3. See if there      is any way you can improve the score. Try additional education, getting a      better language score, more work experience, and/or sometimes if you’re      immigrating with a spouse, see if making the other person the      primary(principal) applicant will do the trick.\n\n**EE Advantages:**\n\n&#x200B;\n\n* Fast (ish)      processing times. Some applications take as little as 2-3 months, some      take closer to 1-2 years.\n* Straightforward      and transparent application process (for now).\n\n**EE Disadvantages:**\n\n&#x200B;\n\n* It’s difficult      to plan ahead since the program will be changing in the upcoming months,      and current scores are so competitive that most people without a Canadian      education/work experience cannot take advantage of this pathway right      away.\n\nNow, about the programs.\n\n[**Federal Skilled Worker Program**](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html) **(FSW)**\n\n&#x200B;\n\n* **Who is it for:** Highly educated      young professionals with superior language skills, who don’t necessarily      have any work experience in Canada. You can still use this program if you      have Canadian work experience, including work experience while studying in      Canada.\n* [Eligibility      requirements](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html) can be accessed by visiting the      government website. Basically, you need to score at least 67 points in      the [selection      grid](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers/six-selection-factors-federal-skilled-workers.html). You must also have at least 1 year (1560      hours over 12 months) of continuous (= no breaks) work experience in the      same skilled position (i.e. you can switch companies, but you cannot      switch the type of work you do).\n\nYou might need to research what work experience is considered skilled, what continuous work experience means, and how to calculate 1 year of work experience. Consider looking into [this resource](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html#skilled).\n\n[**Canadian Experience Class**](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html) **(CEC)**\n\n&#x200B;\n\n* **Who is it for:** People      with at least 1 year of full-time (or equivalent part-time) skilled work      experience in Canada. This pathway is often used by people who came to      Canada as workers or students who transitioned to a work permit after      graduation. It’s flexible, your work experience doesn’t have to be      continuous or in the same position, as long as it’s skilled.\n* **How can you      get Canadian work experience?** I have more info in the “Coming to Canada as      a Worker” part, but you can sometimes work after you complete a Canadian      program of studies, some people can get a work permit based on their      nationality, some can work because their spouse/partner is      studying/working in Canada, and the rest usually need an employer willing      to bring them to Canada. \n* **Eligibility      requirements** are listed on the [government      website](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html). However, be careful, since self-employment      and unauthorized employment are not eligible for this program, and so is      employment during your studies **in Canada**.\n\n[**Federal Skilled Trades**](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html) **(FST)**\n\n&#x200B;\n\n* Who is it for:      people with work experience in skilled trades, namely:\n\n📷\n\nSource: [IRCC](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html#skilled)\n\nIf you aren’t sure if your occupation fits the criteria, go to the [ESDC website](https://noc.esdc.gc.ca/), find your occupation, and verify your choice by comparing your duties to the NOC.\n\n&#x200B;\n\n* The      remaining [eligibility      requirements](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html) are listed on the government website.\n\nOkay, so what if Express Entry is a no go. What else can you do?\n\nAsk yourself,\n\n&#x200B;\n\n* Do you speak      French and English?\n* Do you have      connections to any Canadian provinces? E.g., family, prior visits? \n* Do you have      in-demand skills that could land you a job in Canada, e.g. you are a      software engineer?\n* Do you have a      professional background that happens to correspond with labour shortages      in certain provinces, e.g. healthcare, IT, skilled trades, truck driving?\n\nNow I’m going to show you why asking these questions is important.\n\n**Provincial and Community-Driven Immigration Options**\n\nLet’s start with the basics.\n\n&#x200B;\n\n* Alberta,      British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador,      Northwest Territories, Nova Scotia, Ontario, Prince Edward Island,      Saskatchewan, and Yukon have various immigration pathways for people      interested in immigrating to that province. You can [learn      more about these programs](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/provincial-nominees/works.html) on the province’s website.\n* You may have      noticed that I omitted the province of Quebec. Quebec stands completely      separately when it comes to immigration, since it has its own programs and      selection criteria, which is why I didn’t include it in this article.\n* Community-driven      Immigration Options include [Atlantic      Immigration Program](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/atlantic-immigration.html) and [Rural      and Northern Immigration Pilot Program](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/rural-northern-immigration-pilot/pr-eligibility.html). They have      lower requirements, but a job offer with the community is a must.\n\n**Provinces that can nominate you from the Express Entry Pool of Candidates:**\n\n&#x200B;\n\n* Ontario [nominates](https://www.ontario.ca/page/ontarios-express-entry-human-capital-priorities-stream) people      with strong French and English skills (both at the same time), and people      who have work experience in certain in-demand occupations. You can see      what professions get invited [here.](https://www.ontario.ca/page/2023-ontario-immigrant-nominee-program-updates)\n* Alberta      favours people in certain occupations, people whose first language is      French, people who studied in Canada, and people with family in Alberta.      Read more [here](https://www.alberta.ca/ainp-alberta-express-entry-stream-eligibility.aspx#jumplinks-0) and [here.](https://www.alberta.ca/aaip-updates.aspx) \n* Nova Scotia’s      nominations are a little less transparent, and the province often invites      people who fit very narrow requirements that address the province’s labour      shortages/needs. However, you can learn more about it [here](https://novascotiaimmigration.com/move-here/labour-market-priorities/).\n* Saskatchewan’s[ nominations](https://www.saskatchewan.ca/residents/moving-to-saskatchewan/live-in-saskatchewan/by-immigrating/saskatchewan-immigrant-nominee-program/browse-sinp-programs/applicants-international-skilled-workers/occupation-requirements) usually      correspond to in-demand occupations for that province.\n\n\\*Always check the provincial website to find out if you need to register an expression of interest with them or if just an Express Entry profile is enough.\n\n**Provinces that don’t require a job offer for some of their immigration streams are:**\n\n&#x200B;\n\n* Saskatchewan,      New Brunswick, and PEI – you may be eligible apply if you have an      in-demand occupation.\n* British      Columbia, Ontario, Newfoundland, Manitoba – you can apply if you are a      Canadian Master’s of PhD graduate. Make sure to review program      requirements to see what study programs are acceptable for these      immigration pathways.\n\n**International Graduates**\n\n&#x200B;\n\n* Depending on      the province/community where you studied/are currently working, you will      most likely be able to access some sort of a pathway meant for      international graduates. So, check out the provincial nominee programs as      well as regional (AIP and RNIP) programs.\n* However, your      options will often depend on whether you studied at a private or public      institution, whether your studies were undergraduate or (post)graduate,      how long you studied for, and even the subjects you studied.\n* In general,      you’re better off if you graduated from a public institution, and your      program was either a little longer (2 years or more), or it was a Master’s      of a PhD.\n* **Opportunities      New Brunswick** is a notable exception that allows      international graduates of **several** **private career      colleges** apply for PR straight after graduating if they meet      certain [requirements.](https://www.welcomenb.ca/content/wel-bien/en/private-college-pilot-program.html)\n\nA work of warning: sometimes changing provinces can be a disadvantage and it can disqualify you. E.g. you studied in one province and moved to another one to work. So, do your research.\n\n**French and Common In-demand Skills**\n\n&#x200B;\n\n* Multiple      provinces, such as Ontario, Alberta, and New Brunswick, try to attract      people who are fluent/highly proficient French speakers.\n* Multiple      provinces have pathways for people in Healthcare Occupations.\n* If you      have [unique      professional background in IT](https://www.canada.ca/en/employment-social-development/services/foreign-workers/global-talent/requirements.html#ust), it might be easier for Canadian      companies to hire you, since they may be able to do so through Global      Talent stream. Also, many provinces have pathways for candidates in      technical occupations, such as British Columbia, Ontario, Saskatchewan,      and Manitoba.\n* Truck driving      is a good profession for immigration to Saskatchewan, Ontario, British      Columbia, Alberta, Manitoba, Prince Edward Island, Newfoundland &      Labrador, and Nova Scotia.\n\n**Manitoba:**\n\n[Manitoba](https://immigratemanitoba.com/immigrate-to-manitoba/) is often overlooked due to its tough climate. However, it’s a real gem when it comes to immigration. You may be able to immigrate to Manitoba if you have connections to the province, such as family, friends, previous education, or work in Manitoba. Yes, you read that right, friends can help you immigrate, check out the Skilled Workers Overseas steam. You will, of course, need to meet other requirements, so make sure to review the programs offered by the province of Manitoba.\n\n**Job offer**\n\nMany programs ask you to have a job offer, but that usually does **not** mean that your friend who owns a restaurant can write a letter saying she/he will hire you. \n\n&#x200B;\n\n* **Job offer is      NOT just a letter from a prospective employer or the fact that you’re      employed in Canada,** e.g. when you have an open work permit on a      Working Holiday or Post Graduate open work permit. Job offer usually      requires that your employer shows that they could not recruit a      Canadian/Permanent Resident, and they had to resort to hiring a foreign      worker. Check the requirements of the specific immigration pathway you’re      considering because they differ from province/community to      province/community.\n* Generally,      all **provinces have immigration pathways for applicants with a job      offer from that province**. Make sure to check the requirements that      pertain to the employer, wage, whether your professional background needs      to be related to the job you’re being offered, and recruitment      requirements (i.e., does your employer need to prove they couldn’t hire a      Canadian/PR and how they need to prove it).\n* If job offer      is the only way to go, consider looking into the [Atlantic      Immigration Program](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/atlantic-immigration.html) and the [Rural      and Northern Immigration Pilot](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/rural-northern-immigration-pilot.html). These community-driven pathways      have an established and straightforward system for employers looking to      hire foreign workers. Therefore, securing a job offer in these communities      might be a tiny bit easier.\n\n**Coming to Canada as a Worker**\n\n&#x200B;\n\n* There are some      pathways that provide easy(ish) access to the Canadian labour market, some      of them will be considered a job offer for immigration purposes, others      won’t be.\n* Some of these      pathways depend on your nationality, others cater to specific occupations.      \n\n&#x200B;\n\n* Working       Holiday – easy, but only for certain nationalities.\n* Global Talent       Stream – certain occupations.\n* Intra-Company       Transfer – self-explanatory.\n* [International       agreements](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes.html#r204) (usually based on your country of       nationality).\n\n&#x200B;\n\n* You may also      have an easier time getting a work permit as [a      French speaker](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/canadian-interests-significant-benefit-mobilite-francophone-r205-exemption-code-c16.html). However, speaking French is not the only      requirement, so make sure to review the [government      website](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/canadian-interests-significant-benefit-mobilite-francophone-r205-exemption-code-c16.html).\n* Anyone can get      a work permit through a process called [LMIA](https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/find-need-labour-market-impact-assessment.html#get). However,      your employer must be really motivated and willing to invest time and      money in supporting your application.\n* You can also      work once you graduate from [some study      programs in Canada](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/post-graduation-work-permit-program/eligibility.html) for up to 3 years. \n\n**Provinces/Organizations that recruit foreign workers:**\n\n&#x200B;\n\n* Saskatchewan      is [looking      for healthcare professionals](https://www.saskatchewan.ca/residents/moving-to-saskatchewan/live-in-saskatchewan/by-immigrating/saskatchewan-immigrant-nominee-program/browse-sinp-programs/applicants-international-skilled-workers/international-healthcare-worker-eoi-pool).\n* New Brunswick      usually [recruits      tradespersons](https://www.welcomenb.ca/content/wel-bien/en/recruitment_events.html) as well as [healthcare      and IT professionals](https://talentgnb.ca/).\n* French-speaking      candidates should keep an eye out for [Destination Canada](https://destinationcanada2021.vfairs.com/).\n* BC is looking      for [healthcare      professionals](https://www.healthmatchbc.org/?utm_source=web_redirect&utm_medium=referral&utm_campaign=bchealthcarejobs_redirect).\n* Of course,      there are other recruiters out there. Some are legit, others aren’t. Stay      vigilant and stay away from anyone asking for money for a job offer or      offering something that sounds too good to be true. Even if one is      “successful” in tricking the system, it can and likely will come back and      ruin your life years down the line, so be careful. \n\n**Worker to PR: Does Canadian Work Experience lead to Permanent Residence?**\n\n&#x200B;\n\n* It certainly      helps, but there are no guarantees.\n* You must study      Federal (Express Entry) and Provincial Programs (of the province where you      will be working) and determine what kind of work experience you need to      immigrate, i.e. hours, occupation, wage, etc. You might also want to be      strategic and target a specific province/community to increase your      chances of subsequent immigration.\n* Here’s an      example. You come to Canada on a Working Holiday Work Permit, get 1 year      of skilled work experience, and immigrate under Express Entry Canadian      Experience Class. Sounds simple, doesn’t it? However, if you choose the      wrong type of job (e.g. low skilled), get laid off, or work part-time — you      may be no closer to PR than before you came to Canada.\n\n**Student to PR: Does Studying in Canada lead to Permanent Residence?**\n\n&#x200B;\n\n* Same story. It      helps, but you can easily mess it up if you don’t do research. Only      certain types of study programs will benefit you in terms of future      immigration and your ability to work after graduation. So, plan ahead      BEFORE you get your letter of admission.\n* Usually, there      are more options for people who graduate from longer programs (at least 2      years), or Master’s/PhDr, and programs that [allow you to      work later on](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/post-graduation-work-permit-program/eligibility.html). However, every province has different      criteria, and remember that it’s about how competitive you are as a      candidate, not meeting minimum requirements. \n* If Federal      Pathway is a no-go, check out provincial immigration pathways for the      province/community where you studied/worked, and see what they’re looking      for.\n* Be aware that      getting accepted into a study program is only a small step towards      success. Getting a study permit can be twice as hard. You need to be      strategic about your choice of program, whether you can afford the      studies, and whether you look like a genuine student or someone who’s      trying to get into Canada by any means possible.\n\n**Common problems that I see among students coming to Canada:**\n\n· Not being compliant: working without authorization, working more hours than you’re supposed to.\n\n· Ruining your eligibility for a work permit by studying part-time or missing key deadlines.\n\n· Selecting a program that won’t actually improve your chances of getting PR.\n\n· No prior education and work experience. E.g. an 18-year-old comes, completes a 1-2 year certificate, they struggle to get a job due to lack of experience. Then 20-50k and several years later they cannot get PR. Don’t be like that, do research. \n\n· Alternatively, if you over rely on one immigration pathway and it changes, you might find yourself scrambling and your work permit running out. \n\n· Thinking a visa is a guarantee. If you have 1) low funds, 2) insignificant ties to your home country, 2) temporary status in the country where you live, 3) previous refusals or violations, 4) a study plan that makes no sense career-wise, 5) a similar degree from home, 6) you already have the qualifications you’re trying to obtain, 7) your entire family is coming with you, 8) you have a lot of family in Canada, 9) no previous travel – all these are common factors that can be viewed negatively by processing officers. They won’t necessarily make or break the application, but it’s something to be aware of when applying. \n\n**Can coming to Canada as a visitor lead to PR?**\n\n&#x200B;\n\n* There’s no      direct pathway, and all indirect pathways are very lengthy, expensive, and      basically require you to change status to worker or student (unless you      partner is a Canadian and they sponsor you).\n* You cannot      work as a visitor, and you can only study a short-term course (less than 6      months in TOTAL duration). You might also have to leave Canada in order to      change your immigration status from visitor to something else (in some      cases).\n\n**Visitor – Student – Worker – PR**\n\n&#x200B;\n\n* Visitor to      Student to Worker is one of the ways you can come to Canada as a visitor      and later become a permanent residence.\n* Visitors can      take short-term courses of studies that are under 6 months. This includes      pre-requisite language courses that are required to enrol into some study      programs. If you finish a pre-requisite course, you may be able to apply      for a study permit without leaving Canada.\n* Certain      programs of studies can help you either get a work permit later or become      eligible for certain immigration pathways right after graduation.\n* You must be      careful and research what immigration pathway you will be eligible for      after studying in Canada, and whether your program of studies will allow      you meet those goals.\n\n**Something Else**\n\nThere are also a few pathways that can help you come to Canada, work, and/or immigrate. Make sure to verify whether these pathways are open for receiving new applications and thoroughly research them.\n\n&#x200B;\n\n* [Self-Employed      Person’s Class](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/self-employed-persons.html) — the name is deceiving, this is      actually a pathway for professional athletes, artists, and self-employed      individuals in these fields. It has very narrow eligibility requirements,      high financial requirements, and pretty long processing times.\n* Pathways      for [Caregivers](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/pathways-for-caregivers.html) & [Agri-Food      Pilo](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/agri-food-pilot/about.html)t. These pathways have existed for a      while and they have undergone major changes. Some of those changes stem      from the fact that these programs used to be run by predatory recruiters      and exploitative employers. Is that still the case? I’m not so sure. Also,      caregivers have a brutally small quote that filled up in a matter of hours      this year, so….\n\nGeneral tips:\n\n&#x200B;\n\n* Plan your      immigration with 1-2 backup plans in mind. Immigration programs change,      pause, things don’t go as planned all the time.\n* Don’t start      your job/school search without understanding how it would help you      immigrate (if immigration is your goal). Otherwise, by the time you      realize you enrolled in the wrong program, you could be down 20k and 2      years.\n* Understand      that unexpected things happen. You may not find a job right fter      graduating, you may not get invited for a PNP even though you’re a perfect      candidate. Leave some room for error and have a contingency plan.\n\n**Admissibility**\n\nWhatever your plans are, they could be ruined if you, your spouse, or your children have had run-ins with the law (even the minor ones), or serious medical issues. The good news is, [being inadmissible to Canada](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/inadmissibility.html) is something that you may be able to overcome.\n\nIf you suspect you may be inadmissible and Immigration don’t know (e.g. you already have a visa but something happened after), better address it with a professional before you try to travel to Canada or apply for a visa.\n\nThis applies to bogus criminal matters as well (some of us come from places where made up charges happen), don’t count on border services being aware of your country’s situation. Their priority is the safety of Canadians.\n\nWorst case – you might have to spend a couple of nights in jail while they investigate. Best case (if found out), you will be allowed to leave Canada right away.\n\n**A Few Words on Fraud and Misrepresentation**\n\n&#x200B;\n\n* Unfortunately,      there is an ocean full of fraudsters, preying on people who are desperate      to get a Canadian employer, get a perfect English score, or just move to      Canada one way or the other.\n* While those      offers may seem attractive, or, in some cases, they may seem like the only      option, I strongly advise against accepting them.\n* Canadian      immigration is ruthless towards applicants who misrepresent information in      their applications, and the penalties are quite severe. It won’t matter      whether you knew that what you were doing was wrong, if everyone else was      doing it and you were the only one to get caught, or if it was done      without your knowledge. You will be the one paying the price.\n* [Learn      more](https://www.canada.ca/en/immigration-refugees-citizenship/services/protect-fraud.html) about immigration fraud and don’t      believe any guarantees or promises that are too good to be true.\n\n**What to do if you’re already in the process and encountering some issues? I.e. this is when most people contact a professional** \n\n· **Delays:**\n\n\\- How do I know if my application is delayed:\n\nLook up average processing times. If your application is within those, it might not be time to panic yet. \n\nIf you received multiple document requests or your application is complicated, it may take longer. \n\nAll kinds of forums and groups (Reddit, Facebook) exist where you can get an idea of when to expect updates. They’re helpful because if you see 90% of people get an update in 2 months and it’s been 6 months for you, you should do something. On the other hand, there will always be people whose application is processed faster than yours, there are people giving out questionable advice, and in general, obsessing over your application is a great way to derail your mental health. \n\nSo, use your discretion and prepare to wait longer than you would like to.\n\n\\- Don’t call IRCC every day and send webforms every week. Being overly proactive like this could be harmful to you in the long run. \n\n\\- MP – if you’re in Canada you can contact your Member of Parliament and ask them to follow up for you. I wouldn’t do it unless the application is severely delayed, or you have some compelling circumstanced that make this delay a real problem in your life. \n\n\\- Mandamus – if it’s been really long, find a lawyer and discuss this option. This is a way to “force” the government to make a decision when the delay is unreasonably long (and there are a bunch of other considerations).\n\n\\- Webform & Call Center – again, be reasonable. If your application is delayed or if you just want to feel better and be sure that everything is going well, you can use these options (easily googleable). The Call center can be reached using Skype (paid) subscriptions, but they cannot advise on some applications that are being processed outside Canada.\n\n· **Refusals:**\n\n\\- Application for[ Leave and for Judicial review](https://www.fct-cf.gc.ca/en/pages/representing-yourself/practice-guides/how-to-file-an-application-for-leave-and-for-judicial-review-immigration): while you need a lawyer to challenge a refusal this way, it’s a great option if you feel that you submitted a strong application and the refusal was overly generic or didn’t make sense. E.g. visitor visa refused due to family ties in Canada, but you don’t have family in Canada. Keep in mind that the deadline is 15 days for in-Canada matters, and 60 days for outside Canada matters. \n\n\\- Reapplication: if you didn’t submit a strong application from the start, your circumstances since the last time you applied, or you simply missed the deadline to file for Leave and for Judicial review – this is an option. Make sure you address previous reasons for refusal. \n\n\\- ATIP/GCMS notes: if you get refused or if you have a long and complex immigration history in Canada, always order these before you submit a new application (especially after a refusal). These notes will give you a bit of an insight into why you were refused, as opposed to the generic refusal letter. Anyone in Canada can apply, you can get it for IRCC and for CBSA, and it costs $5.\n\n· **Violating various conditions of your status** – speak to a consultant/lawyer as early as you can. Sometimes, those can be easily overcome if addressed in time. \n\n· **Procedural fairness letter** \n\n\\- If immigration suspect that something’s not adding up, they will provide you with an opportunity to explain yourself before they refuse you (or worse). \n\n\\- This is your chance to make things right, and while I’m not saying that you cannot do it yourself, I wouldn’t advise you to. A response to a PFL is no a simple 1-paragraph explanation, it’s usually when you build an argument with a bunch of proof.\n\n· You worked with an [unauthorized representative ](https://www.canada.ca/en/immigration-refugees-citizenship/services/immigration-citizenship-representative/learn-about-representatives.html)before – yikes. Unfortunately this is common, but it’s still illegal and it could get you in trouble. Not knowing who is authorized to charge for immigration support is no excuse. Don’t do it again!\n\nHowever, if you did it on a previous application, get ATIP/GCMS notes before you proceed just to make sure they didn’t mess things up too much. \n\n· Where to look for information if you’re DIYing:\n\n\\- [IRCC website](https://www.canada.ca/en/immigration-refugees-citizenship.html)\n\n\\- [Processing Manuals](https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals.html)\n\n\\- Ask your authorized representative (but make sure they’re licensed first).\n\nThat’s all, friends. This doesn’t cover 1% of all things immigration, but I hope it can help you better understand how Canadian immigration works and where to look for information. \n\nAnd if you have any questions about family sponsorship, refugee, or humanitarian & compassionate options, please ask away!","selftext_html":"<!-- SC_OFF --><div class=\"md\"><p>Canadian immigration has been a bit of a hot mess for the past couple of years. Programs we’ve grown to rely on are changing and getting more competitive and unpredictable, there is a massive backlog causing delays, Immigration (“IRCC”) are increasingly relying on AI, and we are seeing many generic and often unfair refusals for temporary visas. </p>\n\n<p>So, we thought we’d give you a rundown of how Canadian immigration works these days, what to do if your application is delayed/refused, and a couple of insights along the way. We will be focusing on individual economic immigration. But feel free to ask about family immigration, refugee or humanitarian &amp; compassionate options (please don’t ask about business because we don’t do that kind of work).</p>\n\n<p>Happy to answer any questions that we can 😊</p>\n\n<p>DISCLOSURE: This is a confusing time and we hope this post helps, especially if you&#39;re DIYing your immigration. But we are also licensed professionals, so if this post makes you want to look us up and book a consultation, we&#39;d be happy to help. </p>\n\n<p><strong>Disclaimer:</strong></p>\n\n<p>This guide contains some generalizations, as it is not possible to account for every scenario. You should not use it as an ultimate immigration guide, but merely as a starting point in your research.</p>\n\n<p><strong>Intro</strong><br/>\n Canadian immigration programs tend to prioritize educated professionals with strong English and/or French skills, especially in the industries that are experiencing labour shortages, e.g. healthcare &amp; IT. Canada also seeks to attract more French speakers, so if you speak both official languages or if your French is strong, you might have a slight advantage.</p>\n\n<p>Canada also offers numerous pathways to graduates of some Canadian post-secondary institutions. In general, Canadian education is very popular since immigration programs are getting more and more competitive every year, and a Canadian degree/diploma can tip the balance in your favour. However studying in Canada ≠ guaranteed immigration.</p>\n\n<p>If you have a family member (most commonly, a spouse or a common-law partner or a parent, if you’re under 22), you may be able to immigrate through them. Other relatives usually cannot sponsor you, but in some cases they can slightly improve your chances of immigration.</p>\n\n<p>Lastly, if you are already in Canada and have very unique and very compelling circumstances, and/or are facing danger if returned to your country of origin, you may be eligible for making a refugee claim* or immigration on humanitarian and compassionate grounds. This isn’t really an immigration pathway, it’s more of a last resort for people who are in complex and messy immigration situations.</p>\n\n<p>*There are exceptions to this, and some people can be resettled as refugees by UNHCR officer outside Canada, or sponsored by Canadians, but this post won’t cover these options.</p>\n\n<p><strong>So, let’s say you’re a regular professional without close family in Canada and not in any danger. There are two ways you can immigrate:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Apply for      permanent residence from abroad and land in Canada as a permanent      resident. This process can take anywhere between 1-4 years (from the      moment you submit the application).</li>\n<li>Come to Canada      as a worker/student to become eligible to apply for permanent residence      (PR) from inside Canada. This process usually takes a minimum of 1.5-2      years from the moment you land in Canada, usually longer.</li>\n</ul>\n\n<p>The first option tends to be more difficult, since it usually requires the candidate to have one or more of the following:</p>\n\n<p>a) A highly competitive profile, which can look like superior language skills in one or both of Canada’s official languages, years of skilled work experience, and post-secondary education at a high level (Bachelor’s degree and higher).</p>\n\n<p>b) Work experience in an in-demand profession.</p>\n\n<p>c) A Canadian employer willing to jump through lots of hoops and pay high fees to hire you.</p>\n\n<p>d) Strong connections to a specific province.</p>\n\n<p>d) Strong French skills.</p>\n\n<p>Therefore, many people opt for the second option, and come to Canada as workers, students, or sometimes even visitors, and subsequently become eligible for one of Canada’s immigration pathways.</p>\n\n<p>I will start with Option 1 and cover some Option 2 scenarios afterwards.</p>\n\n<p><strong>What immigration pathways are out there?</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Canada has      Federal, Provincial, and community-driven immigration programs. Federal programs      are more competitive. Provincial and community-driven programs tend to      have lower requirements but often require that the individual has      connections to the province/community. The connections usually need to be      in form of work or studies in the province/community or a job offer.      However, sometimes having relatives, friends, or having visited the      province/community can be enough.</li>\n<li>Most Canadian      immigration pathways are point-based, which means you are assigned points      based on your age, education, work experience, connections to Canada,      language skills, etc. So, even if you read program requirements and you      think that you meet the minimum eligibility criteria – that does not      necessarily mean that you can realistically immigrate through the program      of your choice. </li>\n<li>Temporary      pathways. Sometimes Canada creates new temporary pathways to meet its      immigration goals. E.g. TR to PR during Covid, a pathway for out-of-status      construction workers. If it sounds too good to be true, double-check, it      may no longer be valid. </li>\n</ul>\n\n<p><strong>Express Entry (EE)</strong></p>\n\n<p><strong>Disclaimer:</strong> EE is probably what most people know when it comes to Canadian immigration. However, this year (2023) the system will be undergoing significant changes and it will favour candidates in in-demand occupations and potentially candidates with Canadian education/work experience. What are those occupations? We don’t know yet. Do I think you should still consider this pathway? Absolutely. </p>\n\n<p>EE is a Federal Immigration system that manages intake into 3 immigration programs: <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html\">Federal Skilled Worker</a>(FSW), <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html\">Canadian Experience Class</a> (CEC), and <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html\">Federal Skilled Trades</a> (FST). In addition to that, there are some Provincial Immigration programs that are processed through Express Entry. I would normally suggest that people look at EE as a starting point, but it has become increasingly competitive over the years. </p>\n\n<p><strong>How does EE work?</strong></p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Read the      eligibility requirements for the 3 programs and confirm that you are      eligible for at least one of them.</li>\n<li>Write an <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/documents/language-requirements/language-testing.html\">immigration-approved      English/French test</a> and have your highest Educational      Credential assessed by a <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/documents/education-assessed/how.html\">designated      organization</a>.</li>\n<li>Create a      free <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/submit-profile.html\">online      profile</a>.</li>\n<li>Get an      invitation to apply (if you are amongst the highest scoring candidates or      a province nominates you).</li>\n<li>Submit an      application for permanent residence.</li>\n</ol>\n\n<p><strong>How do you know if your profile is competitive for any programs managed through Express Entry?</strong></p>\n\n<p>These are the steps:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Calculate your      score using the <a href=\"https://www.cic.gc.ca/english/immigrate/skilled/crs-tool.asp\">online      tool:</a></li>\n<li>Check <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/mandate/policies-operational-instructions-agreements/ministerial-instructions/express-entry-rounds.html\">scores</a> under      your program or “No program specified” and see where you stand. Right now      scores are pretty high, but before COVID-19 they were in 470s. There were      some crazy low scores in 2021 as the government were trying really hard to      hit their immigration objectives, but I wouldn’t expect it to go this low      in the foreseeable future. </li>\n<li>See if there      is any way you can improve the score. Try additional education, getting a      better language score, more work experience, and/or sometimes if you’re      immigrating with a spouse, see if making the other person the      primary(principal) applicant will do the trick.</li>\n</ol>\n\n<p><strong>EE Advantages:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Fast (ish)      processing times. Some applications take as little as 2-3 months, some      take closer to 1-2 years.</li>\n<li>Straightforward      and transparent application process (for now).</li>\n</ul>\n\n<p><strong>EE Disadvantages:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>It’s difficult      to plan ahead since the program will be changing in the upcoming months,      and current scores are so competitive that most people without a Canadian      education/work experience cannot take advantage of this pathway right      away.</li>\n</ul>\n\n<p>Now, about the programs.</p>\n\n<p><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html\"><strong>Federal Skilled Worker Program</strong></a> <strong>(FSW)</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Who is it for:</strong> Highly educated      young professionals with superior language skills, who don’t necessarily      have any work experience in Canada. You can still use this program if you      have Canadian work experience, including work experience while studying in      Canada.</li>\n<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html\">Eligibility      requirements</a> can be accessed by visiting the      government website. Basically, you need to score at least 67 points in      the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers/six-selection-factors-federal-skilled-workers.html\">selection      grid</a>. You must also have at least 1 year (1560      hours over 12 months) of continuous (= no breaks) work experience in the      same skilled position (i.e. you can switch companies, but you cannot      switch the type of work you do).</li>\n</ul>\n\n<p>You might need to research what work experience is considered skilled, what continuous work experience means, and how to calculate 1 year of work experience. Consider looking into <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/federal-skilled-workers.html#skilled\">this resource</a>.</p>\n\n<p><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html\"><strong>Canadian Experience Class</strong></a> <strong>(CEC)</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Who is it for:</strong> People      with at least 1 year of full-time (or equivalent part-time) skilled work      experience in Canada. This pathway is often used by people who came to      Canada as workers or students who transitioned to a work permit after      graduation. It’s flexible, your work experience doesn’t have to be      continuous or in the same position, as long as it’s skilled.</li>\n<li><strong>How can you      get Canadian work experience?</strong> I have more info in the “Coming to Canada as      a Worker” part, but you can sometimes work after you complete a Canadian      program of studies, some people can get a work permit based on their      nationality, some can work because their spouse/partner is      studying/working in Canada, and the rest usually need an employer willing      to bring them to Canada. </li>\n<li><strong>Eligibility      requirements</strong> are listed on the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/canadian-experience-class.html\">government      website</a>. However, be careful, since self-employment      and unauthorized employment are not eligible for this program, and so is      employment during your studies <strong>in Canada</strong>.</li>\n</ul>\n\n<p><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html\"><strong>Federal Skilled Trades</strong></a> <strong>(FST)</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Who is it for:      people with work experience in skilled trades, namely:</li>\n</ul>\n\n<p>📷</p>\n\n<p>Source: <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html#skilled\">IRCC</a></p>\n\n<p>If you aren’t sure if your occupation fits the criteria, go to the <a href=\"https://noc.esdc.gc.ca/\">ESDC website</a>, find your occupation, and verify your choice by comparing your duties to the NOC.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>The      remaining <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/express-entry/eligibility/skilled-trades.html\">eligibility      requirements</a> are listed on the government website.</li>\n</ul>\n\n<p>Okay, so what if Express Entry is a no go. What else can you do?</p>\n\n<p>Ask yourself,</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Do you speak      French and English?</li>\n<li>Do you have      connections to any Canadian provinces? E.g., family, prior visits? </li>\n<li>Do you have      in-demand skills that could land you a job in Canada, e.g. you are a      software engineer?</li>\n<li>Do you have a      professional background that happens to correspond with labour shortages      in certain provinces, e.g. healthcare, IT, skilled trades, truck driving?</li>\n</ul>\n\n<p>Now I’m going to show you why asking these questions is important.</p>\n\n<p><strong>Provincial and Community-Driven Immigration Options</strong></p>\n\n<p>Let’s start with the basics.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Alberta,      British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador,      Northwest Territories, Nova Scotia, Ontario, Prince Edward Island,      Saskatchewan, and Yukon have various immigration pathways for people      interested in immigrating to that province. You can <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/provincial-nominees/works.html\">learn      more about these programs</a> on the province’s website.</li>\n<li>You may have      noticed that I omitted the province of Quebec. Quebec stands completely      separately when it comes to immigration, since it has its own programs and      selection criteria, which is why I didn’t include it in this article.</li>\n<li>Community-driven      Immigration Options include <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/atlantic-immigration.html\">Atlantic      Immigration Program</a> and <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/rural-northern-immigration-pilot/pr-eligibility.html\">Rural      and Northern Immigration Pilot Program</a>. They have      lower requirements, but a job offer with the community is a must.</li>\n</ul>\n\n<p><strong>Provinces that can nominate you from the Express Entry Pool of Candidates:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Ontario <a href=\"https://www.ontario.ca/page/ontarios-express-entry-human-capital-priorities-stream\">nominates</a> people      with strong French and English skills (both at the same time), and people      who have work experience in certain in-demand occupations. You can see      what professions get invited <a href=\"https://www.ontario.ca/page/2023-ontario-immigrant-nominee-program-updates\">here.</a></li>\n<li>Alberta      favours people in certain occupations, people whose first language is      French, people who studied in Canada, and people with family in Alberta.      Read more <a href=\"https://www.alberta.ca/ainp-alberta-express-entry-stream-eligibility.aspx#jumplinks-0\">here</a> and <a href=\"https://www.alberta.ca/aaip-updates.aspx\">here.</a> </li>\n<li>Nova Scotia’s      nominations are a little less transparent, and the province often invites      people who fit very narrow requirements that address the province’s labour      shortages/needs. However, you can learn more about it <a href=\"https://novascotiaimmigration.com/move-here/labour-market-priorities/\">here</a>.</li>\n<li>Saskatchewan’s<a href=\"https://www.saskatchewan.ca/residents/moving-to-saskatchewan/live-in-saskatchewan/by-immigrating/saskatchewan-immigrant-nominee-program/browse-sinp-programs/applicants-international-skilled-workers/occupation-requirements\"> nominations</a> usually      correspond to in-demand occupations for that province.</li>\n</ul>\n\n<p>*Always check the provincial website to find out if you need to register an expression of interest with them or if just an Express Entry profile is enough.</p>\n\n<p><strong>Provinces that don’t require a job offer for some of their immigration streams are:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Saskatchewan,      New Brunswick, and PEI – you may be eligible apply if you have an      in-demand occupation.</li>\n<li>British      Columbia, Ontario, Newfoundland, Manitoba – you can apply if you are a      Canadian Master’s of PhD graduate. Make sure to review program      requirements to see what study programs are acceptable for these      immigration pathways.</li>\n</ul>\n\n<p><strong>International Graduates</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Depending on      the province/community where you studied/are currently working, you will      most likely be able to access some sort of a pathway meant for      international graduates. So, check out the provincial nominee programs as      well as regional (AIP and RNIP) programs.</li>\n<li>However, your      options will often depend on whether you studied at a private or public      institution, whether your studies were undergraduate or (post)graduate,      how long you studied for, and even the subjects you studied.</li>\n<li>In general,      you’re better off if you graduated from a public institution, and your      program was either a little longer (2 years or more), or it was a Master’s      of a PhD.</li>\n<li><strong>Opportunities      New Brunswick</strong> is a notable exception that allows      international graduates of <strong>several</strong> <strong>private career      colleges</strong> apply for PR straight after graduating if they meet      certain <a href=\"https://www.welcomenb.ca/content/wel-bien/en/private-college-pilot-program.html\">requirements.</a></li>\n</ul>\n\n<p>A work of warning: sometimes changing provinces can be a disadvantage and it can disqualify you. E.g. you studied in one province and moved to another one to work. So, do your research.</p>\n\n<p><strong>French and Common In-demand Skills</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Multiple      provinces, such as Ontario, Alberta, and New Brunswick, try to attract      people who are fluent/highly proficient French speakers.</li>\n<li>Multiple      provinces have pathways for people in Healthcare Occupations.</li>\n<li>If you      have <a href=\"https://www.canada.ca/en/employment-social-development/services/foreign-workers/global-talent/requirements.html#ust\">unique      professional background in IT</a>, it might be easier for Canadian      companies to hire you, since they may be able to do so through Global      Talent stream. Also, many provinces have pathways for candidates in      technical occupations, such as British Columbia, Ontario, Saskatchewan,      and Manitoba.</li>\n<li>Truck driving      is a good profession for immigration to Saskatchewan, Ontario, British      Columbia, Alberta, Manitoba, Prince Edward Island, Newfoundland &amp;      Labrador, and Nova Scotia.</li>\n</ul>\n\n<p><strong>Manitoba:</strong></p>\n\n<p><a href=\"https://immigratemanitoba.com/immigrate-to-manitoba/\">Manitoba</a> is often overlooked due to its tough climate. However, it’s a real gem when it comes to immigration. You may be able to immigrate to Manitoba if you have connections to the province, such as family, friends, previous education, or work in Manitoba. Yes, you read that right, friends can help you immigrate, check out the Skilled Workers Overseas steam. You will, of course, need to meet other requirements, so make sure to review the programs offered by the province of Manitoba.</p>\n\n<p><strong>Job offer</strong></p>\n\n<p>Many programs ask you to have a job offer, but that usually does <strong>not</strong> mean that your friend who owns a restaurant can write a letter saying she/he will hire you. </p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Job offer is      NOT just a letter from a prospective employer or the fact that you’re      employed in Canada,</strong> e.g. when you have an open work permit on a      Working Holiday or Post Graduate open work permit. Job offer usually      requires that your employer shows that they could not recruit a      Canadian/Permanent Resident, and they had to resort to hiring a foreign      worker. Check the requirements of the specific immigration pathway you’re      considering because they differ from province/community to      province/community.</li>\n<li>Generally,      all <strong>provinces have immigration pathways for applicants with a job      offer from that province</strong>. Make sure to check the requirements that      pertain to the employer, wage, whether your professional background needs      to be related to the job you’re being offered, and recruitment      requirements (i.e., does your employer need to prove they couldn’t hire a      Canadian/PR and how they need to prove it).</li>\n<li>If job offer      is the only way to go, consider looking into the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/atlantic-immigration.html\">Atlantic      Immigration Program</a> and the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/rural-northern-immigration-pilot.html\">Rural      and Northern Immigration Pilot</a>. These community-driven pathways      have an established and straightforward system for employers looking to      hire foreign workers. Therefore, securing a job offer in these communities      might be a tiny bit easier.</li>\n</ul>\n\n<p><strong>Coming to Canada as a Worker</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>There are some      pathways that provide easy(ish) access to the Canadian labour market, some      of them will be considered a job offer for immigration purposes, others      won’t be.</li>\n<li>Some of these      pathways depend on your nationality, others cater to specific occupations.<br/></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Working       Holiday – easy, but only for certain nationalities.</li>\n<li>Global Talent       Stream – certain occupations.</li>\n<li>Intra-Company       Transfer – self-explanatory.</li>\n<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes.html#r204\">International       agreements</a> (usually based on your country of       nationality).</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>You may also      have an easier time getting a work permit as <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/canadian-interests-significant-benefit-mobilite-francophone-r205-exemption-code-c16.html\">a      French speaker</a>. However, speaking French is not the only      requirement, so make sure to review the <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/foreign-workers/exemption-codes/canadian-interests-significant-benefit-mobilite-francophone-r205-exemption-code-c16.html\">government      website</a>.</li>\n<li>Anyone can get      a work permit through a process called <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/hire-temporary-foreign/find-need-labour-market-impact-assessment.html#get\">LMIA</a>. However,      your employer must be really motivated and willing to invest time and      money in supporting your application.</li>\n<li>You can also      work once you graduate from <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/post-graduation-work-permit-program/eligibility.html\">some study      programs in Canada</a> for up to 3 years. </li>\n</ul>\n\n<p><strong>Provinces/Organizations that recruit foreign workers:</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Saskatchewan      is <a href=\"https://www.saskatchewan.ca/residents/moving-to-saskatchewan/live-in-saskatchewan/by-immigrating/saskatchewan-immigrant-nominee-program/browse-sinp-programs/applicants-international-skilled-workers/international-healthcare-worker-eoi-pool\">looking      for healthcare professionals</a>.</li>\n<li>New Brunswick      usually <a href=\"https://www.welcomenb.ca/content/wel-bien/en/recruitment_events.html\">recruits      tradespersons</a> as well as <a href=\"https://talentgnb.ca/\">healthcare      and IT professionals</a>.</li>\n<li>French-speaking      candidates should keep an eye out for <a href=\"https://destinationcanada2021.vfairs.com/\">Destination Canada</a>.</li>\n<li>BC is looking      for <a href=\"https://www.healthmatchbc.org/?utm_source=web_redirect&amp;utm_medium=referral&amp;utm_campaign=bchealthcarejobs_redirect\">healthcare      professionals</a>.</li>\n<li>Of course,      there are other recruiters out there. Some are legit, others aren’t. Stay      vigilant and stay away from anyone asking for money for a job offer or      offering something that sounds too good to be true. Even if one is      “successful” in tricking the system, it can and likely will come back and      ruin your life years down the line, so be careful. </li>\n</ul>\n\n<p><strong>Worker to PR: Does Canadian Work Experience lead to Permanent Residence?</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>It certainly      helps, but there are no guarantees.</li>\n<li>You must study      Federal (Express Entry) and Provincial Programs (of the province where you      will be working) and determine what kind of work experience you need to      immigrate, i.e. hours, occupation, wage, etc. You might also want to be      strategic and target a specific province/community to increase your      chances of subsequent immigration.</li>\n<li>Here’s an      example. You come to Canada on a Working Holiday Work Permit, get 1 year      of skilled work experience, and immigrate under Express Entry Canadian      Experience Class. Sounds simple, doesn’t it? However, if you choose the      wrong type of job (e.g. low skilled), get laid off, or work part-time — you      may be no closer to PR than before you came to Canada.</li>\n</ul>\n\n<p><strong>Student to PR: Does Studying in Canada lead to Permanent Residence?</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Same story. It      helps, but you can easily mess it up if you don’t do research. Only      certain types of study programs will benefit you in terms of future      immigration and your ability to work after graduation. So, plan ahead      BEFORE you get your letter of admission.</li>\n<li>Usually, there      are more options for people who graduate from longer programs (at least 2      years), or Master’s/PhDr, and programs that <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/temporary-residents/study-permits/post-graduation-work-permit-program/eligibility.html\">allow you to      work later on</a>. However, every province has different      criteria, and remember that it’s about how competitive you are as a      candidate, not meeting minimum requirements. </li>\n<li>If Federal      Pathway is a no-go, check out provincial immigration pathways for the      province/community where you studied/worked, and see what they’re looking      for.</li>\n<li>Be aware that      getting accepted into a study program is only a small step towards      success. Getting a study permit can be twice as hard. You need to be      strategic about your choice of program, whether you can afford the      studies, and whether you look like a genuine student or someone who’s      trying to get into Canada by any means possible.</li>\n</ul>\n\n<p><strong>Common problems that I see among students coming to Canada:</strong></p>\n\n<p>· Not being compliant: working without authorization, working more hours than you’re supposed to.</p>\n\n<p>· Ruining your eligibility for a work permit by studying part-time or missing key deadlines.</p>\n\n<p>· Selecting a program that won’t actually improve your chances of getting PR.</p>\n\n<p>· No prior education and work experience. E.g. an 18-year-old comes, completes a 1-2 year certificate, they struggle to get a job due to lack of experience. Then 20-50k and several years later they cannot get PR. Don’t be like that, do research. </p>\n\n<p>· Alternatively, if you over rely on one immigration pathway and it changes, you might find yourself scrambling and your work permit running out. </p>\n\n<p>· Thinking a visa is a guarantee. If you have 1) low funds, 2) insignificant ties to your home country, 2) temporary status in the country where you live, 3) previous refusals or violations, 4) a study plan that makes no sense career-wise, 5) a similar degree from home, 6) you already have the qualifications you’re trying to obtain, 7) your entire family is coming with you, 8) you have a lot of family in Canada, 9) no previous travel – all these are common factors that can be viewed negatively by processing officers. They won’t necessarily make or break the application, but it’s something to be aware of when applying. </p>\n\n<p><strong>Can coming to Canada as a visitor lead to PR?</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>There’s no      direct pathway, and all indirect pathways are very lengthy, expensive, and      basically require you to change status to worker or student (unless you      partner is a Canadian and they sponsor you).</li>\n<li>You cannot      work as a visitor, and you can only study a short-term course (less than 6      months in TOTAL duration). You might also have to leave Canada in order to      change your immigration status from visitor to something else (in some      cases).</li>\n</ul>\n\n<p><strong>Visitor – Student – Worker – PR</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Visitor to      Student to Worker is one of the ways you can come to Canada as a visitor      and later become a permanent residence.</li>\n<li>Visitors can      take short-term courses of studies that are under 6 months. This includes      pre-requisite language courses that are required to enrol into some study      programs. If you finish a pre-requisite course, you may be able to apply      for a study permit without leaving Canada.</li>\n<li>Certain      programs of studies can help you either get a work permit later or become      eligible for certain immigration pathways right after graduation.</li>\n<li>You must be      careful and research what immigration pathway you will be eligible for      after studying in Canada, and whether your program of studies will allow      you meet those goals.</li>\n</ul>\n\n<p><strong>Something Else</strong></p>\n\n<p>There are also a few pathways that can help you come to Canada, work, and/or immigrate. Make sure to verify whether these pathways are open for receiving new applications and thoroughly research them.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/self-employed-persons.html\">Self-Employed      Person’s Class</a> — the name is deceiving, this is      actually a pathway for professional athletes, artists, and self-employed      individuals in these fields. It has very narrow eligibility requirements,      high financial requirements, and pretty long processing times.</li>\n<li>Pathways      for <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals/permanent-residence/economic-classes/pathways-for-caregivers.html\">Caregivers</a> &amp; <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/agri-food-pilot/about.html\">Agri-Food      Pilo</a>t. These pathways have existed for a      while and they have undergone major changes. Some of those changes stem      from the fact that these programs used to be run by predatory recruiters      and exploitative employers. Is that still the case? I’m not so sure. Also,      caregivers have a brutally small quote that filled up in a matter of hours      this year, so….</li>\n</ul>\n\n<p>General tips:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Plan your      immigration with 1-2 backup plans in mind. Immigration programs change,      pause, things don’t go as planned all the time.</li>\n<li>Don’t start      your job/school search without understanding how it would help you      immigrate (if immigration is your goal). Otherwise, by the time you      realize you enrolled in the wrong program, you could be down 20k and 2      years.</li>\n<li>Understand      that unexpected things happen. You may not find a job right fter      graduating, you may not get invited for a PNP even though you’re a perfect      candidate. Leave some room for error and have a contingency plan.</li>\n</ul>\n\n<p><strong>Admissibility</strong></p>\n\n<p>Whatever your plans are, they could be ruined if you, your spouse, or your children have had run-ins with the law (even the minor ones), or serious medical issues. The good news is, <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigrate-canada/inadmissibility.html\">being inadmissible to Canada</a> is something that you may be able to overcome.</p>\n\n<p>If you suspect you may be inadmissible and Immigration don’t know (e.g. you already have a visa but something happened after), better address it with a professional before you try to travel to Canada or apply for a visa.</p>\n\n<p>This applies to bogus criminal matters as well (some of us come from places where made up charges happen), don’t count on border services being aware of your country’s situation. Their priority is the safety of Canadians.</p>\n\n<p>Worst case – you might have to spend a couple of nights in jail while they investigate. Best case (if found out), you will be allowed to leave Canada right away.</p>\n\n<p><strong>A Few Words on Fraud and Misrepresentation</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Unfortunately,      there is an ocean full of fraudsters, preying on people who are desperate      to get a Canadian employer, get a perfect English score, or just move to      Canada one way or the other.</li>\n<li>While those      offers may seem attractive, or, in some cases, they may seem like the only      option, I strongly advise against accepting them.</li>\n<li>Canadian      immigration is ruthless towards applicants who misrepresent information in      their applications, and the penalties are quite severe. It won’t matter      whether you knew that what you were doing was wrong, if everyone else was      doing it and you were the only one to get caught, or if it was done      without your knowledge. You will be the one paying the price.</li>\n<li><a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/protect-fraud.html\">Learn      more</a> about immigration fraud and don’t      believe any guarantees or promises that are too good to be true.</li>\n</ul>\n\n<p><strong>What to do if you’re already in the process and encountering some issues? I.e. this is when most people contact a professional</strong> </p>\n\n<p>· <strong>Delays:</strong></p>\n\n<p>- How do I know if my application is delayed:</p>\n\n<p>Look up average processing times. If your application is within those, it might not be time to panic yet. </p>\n\n<p>If you received multiple document requests or your application is complicated, it may take longer. </p>\n\n<p>All kinds of forums and groups (Reddit, Facebook) exist where you can get an idea of when to expect updates. They’re helpful because if you see 90% of people get an update in 2 months and it’s been 6 months for you, you should do something. On the other hand, there will always be people whose application is processed faster than yours, there are people giving out questionable advice, and in general, obsessing over your application is a great way to derail your mental health. </p>\n\n<p>So, use your discretion and prepare to wait longer than you would like to.</p>\n\n<p>- Don’t call IRCC every day and send webforms every week. Being overly proactive like this could be harmful to you in the long run. </p>\n\n<p>- MP – if you’re in Canada you can contact your Member of Parliament and ask them to follow up for you. I wouldn’t do it unless the application is severely delayed, or you have some compelling circumstanced that make this delay a real problem in your life. </p>\n\n<p>- Mandamus – if it’s been really long, find a lawyer and discuss this option. This is a way to “force” the government to make a decision when the delay is unreasonably long (and there are a bunch of other considerations).</p>\n\n<p>- Webform &amp; Call Center – again, be reasonable. If your application is delayed or if you just want to feel better and be sure that everything is going well, you can use these options (easily googleable). The Call center can be reached using Skype (paid) subscriptions, but they cannot advise on some applications that are being processed outside Canada.</p>\n\n<p>· <strong>Refusals:</strong></p>\n\n<p>- Application for<a href=\"https://www.fct-cf.gc.ca/en/pages/representing-yourself/practice-guides/how-to-file-an-application-for-leave-and-for-judicial-review-immigration\"> Leave and for Judicial review</a>: while you need a lawyer to challenge a refusal this way, it’s a great option if you feel that you submitted a strong application and the refusal was overly generic or didn’t make sense. E.g. visitor visa refused due to family ties in Canada, but you don’t have family in Canada. Keep in mind that the deadline is 15 days for in-Canada matters, and 60 days for outside Canada matters. </p>\n\n<p>- Reapplication: if you didn’t submit a strong application from the start, your circumstances since the last time you applied, or you simply missed the deadline to file for Leave and for Judicial review – this is an option. Make sure you address previous reasons for refusal. </p>\n\n<p>- ATIP/GCMS notes: if you get refused or if you have a long and complex immigration history in Canada, always order these before you submit a new application (especially after a refusal). These notes will give you a bit of an insight into why you were refused, as opposed to the generic refusal letter. Anyone in Canada can apply, you can get it for IRCC and for CBSA, and it costs $5.</p>\n\n<p>· <strong>Violating various conditions of your status</strong> – speak to a consultant/lawyer as early as you can. Sometimes, those can be easily overcome if addressed in time. </p>\n\n<p>· <strong>Procedural fairness letter</strong> </p>\n\n<p>- If immigration suspect that something’s not adding up, they will provide you with an opportunity to explain yourself before they refuse you (or worse). </p>\n\n<p>- This is your chance to make things right, and while I’m not saying that you cannot do it yourself, I wouldn’t advise you to. A response to a PFL is no a simple 1-paragraph explanation, it’s usually when you build an argument with a bunch of proof.</p>\n\n<p>· You worked with an <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/services/immigration-citizenship-representative/learn-about-representatives.html\">unauthorized representative </a>before – yikes. Unfortunately this is common, but it’s still illegal and it could get you in trouble. Not knowing who is authorized to charge for immigration support is no excuse. Don’t do it again!</p>\n\n<p>However, if you did it on a previous application, get ATIP/GCMS notes before you proceed just to make sure they didn’t mess things up too much. </p>\n\n<p>· Where to look for information if you’re DIYing:</p>\n\n<p>- <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship.html\">IRCC website</a></p>\n\n<p>- <a href=\"https://www.canada.ca/en/immigration-refugees-citizenship/corporate/publications-manuals/operational-bulletins-manuals.html\">Processing Manuals</a></p>\n\n<p>- Ask your authorized representative (but make sure they’re licensed first).</p>\n\n<p>That’s all, friends. This doesn’t cover 1% of all things immigration, but I hope it can help you better understand how Canadian immigration works and where to look for information. </p>\n\n<p>And if you have any questions about family sponsorship, refugee, or humanitarian &amp; compassionate options, please ask away!</p>\n</div><!-- SC_ON -->","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"IWantOut","subreddit_id":"t5_2r5hw","subreddit_name_prefixed":"r/IWantOut","subreddit_subscribers":1999039,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"[GUIDE] Canadian immigration in 2023, co-written by immigration consultant (OP) and immigration lawyer aliesna_IMMLaw","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":171,"upvote_ratio":0.9300000071525574,"url":"https://www.reddit.com/r/IWantOut/comments/10yysxt/guide_canadian_immigration_in_2023_cowritten_by/","user_reports":[],"view_count":null,"visited":false,"whitelist_status":"all_ads","wls":6}],"discussion_type":null,"distinguished":null,"domain":"self.IWantOut","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"13pid6m","is_created_from_ads_ui":false,"is_crosspostable":false,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":false,"is_self":false,"is_video":false,"likes":null,"link_flair_background_color":"#46d160","link_flair_css_class":"","link_flair_richtext":[{"e":"text","t":"分享帖"}],"link_flair_template_id":"523fae80-a4bb-11ec-a57d-2a79825b6cd4","link_flair_text":"分享帖","link_flair_text_color":"dark","link_flair_type":"richtext","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_13pid6m","no_follow":true,"num_comments":0,"num_crossposts":0,"num_reports":null,"over_18":false,"parent_whitelist_status":null,"permalink":"/r/iwanttorun/comments/13pid6m/2023加拿大移民指南/","pinned":false,"pwls":null,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":"moderator","report_reasons":null,"retrieved_on":1692355216,"saved":false,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"iwanttorun","subreddit_id":"t5_42jf61","subreddit_name_prefixed":"r/iwanttorun","subreddit_subscribers":29168,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":null,"thumbnail_width":null,"title":"2023加拿大移民指南","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":1,"upvote_ratio":1,"url":"/r/IWantOut/comments/10yysxt/guide_canadian_immigration_in_2023_cowritten_by/","url_overridden_by_dest":"/r/IWantOut/comments/10yysxt/guide_canadian_immigration_in_2023_cowritten_by/","user_reports":[],"view_count":null,"visited":false,"whitelist_status":null,"wls":null}
