{"_meta":{"is_edited":true,"removal_type":"reddit","retrieved_2nd_on":1739483530,"was_initially_deleted":true},"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"zhinarchist","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_kfqy9q9m2","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1739353918,"created_utc":1739353918,"discussion_type":null,"distinguished":null,"domain":"self.runtoJapan","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1inni84","is_created_from_ads_ui":false,"is_crosspostable":false,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":false,"is_self":true,"is_video":false,"likes":null,"link_flair_background_color":"#94e044","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"6c08b370-4933-11ee-b8c4-ba3887fd11af","link_flair_text":"🔰不懂就问","link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1inni84","no_follow":true,"num_comments":59,"num_crossposts":0,"num_reports":null,"over_18":false,"permalink":"/r/runtoJapan/comments/1inni84/语校谎报出勤率有什么办法应对吗/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":"reddit","report_reasons":null,"retrieved_on":1739353940,"saved":false,"score":60,"secure_media":null,"secure_media_embed":{},"selftext":"op目前坐标某高马附近校区知名事b语校。该学校是一所以高频率高强度的pua和パワハラ学生为手段拉起虚高升学率并将其作为招牌的学校，不说名字估计都能轻松猜到了。\n\n这所语校的老师和事务老师会经常给学生谈话施压，像是以“我要扣你出勤率”+“出勤率低了就没签证，你想回国吗？”这两种用恶意扣除照常出勤学生的出勤率为威胁的说辞轮流上阵组成一套连招是他们最常用的手段之一。而施压和威胁学生的目的除了一些老师想过权瘾之外，大多是为了挤压学生个人时间以及自行备考eju的考学时间要求其提高语校内考试成绩，然后把学生往唯一会看语校成绩的F级大学输送（曾给日经大做广告，并且每天都会推各种F级烂大学的广告同时对这些烂大学硬夸一番，美其名曰“给学生提供升学情报”），并以用此类手段拉起来的虚高升学率作为招牌+高额学费所以可以付给黑心中介更多佣金上更高的推荐位的二板斧，成为了日本最知名的语校之一。\n\n一个月前那个黄毛小留不知道大家还有没有印象，那人是我同班同学，当时黄毛踢桌子，并且和后面另一个大个子男小留吵架的时候我就在场，而那件事的起因是当时授课的老师日常因为一点小事用“扣出勤率”威胁班上的学生+日常贴脸近距离施压，而正好这次是那个黄毛小留被威胁，那黄毛本来就不怎么服这群教着水课却权瘾爆炸的老师，然后他当时又正好已经被下个学校录取了，更没理由听老师让他“认真听讲，提高语校成绩”的那一套说辞，去上课的所有目的仅仅只是最后去学校混个出勤率而已，结果那天的授课老师就在这个时候精准踩雷，威胁不配合就要扣他一整天出勤率，最后成功导致那天黄毛直接在班上引发了骚乱.....事后黄毛也因为被拍了视频并被发到网上，事情闹大了，过了两天被开除了。\n\n不过，黄毛被开除的主要原因不是闹出了骚乱，而是被拍到了视频发到了网上，把影响闹大了，比起学生和老师的安危，语校显然只在乎自己的财路。因为，其实像黄毛那次的这种上课途中突然有人闹起来了的事情在我那所语校并不少见，之前不同楼层的人也有过几次“掀桌子”之类的夸张举动，原因据同学口口相传，不出意料又是某个同学在被某个老师日常用扣出勤率/贴脸施压的方式威胁了之后压力表被压爆了。\n\n而仅仅是黄毛掀桌子的隔两天，班上就又发生了骚乱，这次比掀桌子更严重，两个班上的男同学直接打了起来，互相扔桌子上的东西，缠斗在一起。扔东西的时候很多同学差点被砸到。\n\n说实话，回想起来，就算单纯从人身安全的层面考虑，继续在这个奇葩语校上课我也有点后怕，很难想象这是日本最知名且最贵的语校之一的授课环境...\n\n而这一切，归根结底，只是因为语校方为了自己学校的升学率，采取了不停给学生施压，并以此来逼迫学生更多在“语校考试成绩”这种对学生来说毫无意义的事情上进行额外投入的行为方式，造成了这种极度容易引发骚乱，甚至可能导致学生因骚乱受伤的高压环境。\n\n除此之外，语校的工作人员的素质也极差，一个男性事务老师经常会对学生解释事情的时候用“就算你被车撞到住院了，没来学校的话就也得扣出勤率”之类带有浓烈主观恶意言辞。\n\n并且，此前这个男性事务老师还曾带着另一个工作人员对班上的同学进行肢体拉扯，试图将其拖拽出教室。起因是在语校并没有收手机的规定的情况下，那名同学的手机被当天授课的女性老师强行夺走，而那名同学因此离开了自己的座位，面带微笑的试图向那个女性老师索要回自己的手机，老师却没想到他敢问自己要回手机而急眼了，丝毫没想过自己强抢了一个成年人的手机有多不妥，对那个同学一顿喷。最后的结果是被抢手机的同学在被拉扯后终于找到机会拿回了手机，然后被那个男事务老师威胁说“你这是妨碍授课，我们要报警”之后再也绷不住带笑的态度了，用中文骂了那个男老师几句，接着就回座位上黑着脸不理他们了，说他们“浪费的时间已经够多了，我们付了钱的，请继续上课”。（顺带一提，抢手机的女老师和黄毛踢桌子前威胁要扣黄毛出勤率的老师是同一人。这个老师还很喜欢在学生答错问题的时候故意提高音量，故作惊讶的说“xx桑这你都不会？”之类的话，所以我对她印象很深刻。）\n\n除了这些肢体冲突级别的事情以外，其他还经常有一些老师会隔三差五到你面前和你0帧起手展开一段对话，然后就可能在这段对话中不停暗示你“不把所有精力放在提高语校成绩上你就考不上大学，就续不了签证”之类的，然后再在基于这种完全扯淡的假设的情况下不停逼问你“你想回中国吗？不想要签证了吗？”，以及一些更多的踩着歧视的边缘反复横跳的话语。\n\n又或是刚入学不久时一些老师会在上课的时候以为学生听不懂日语，故意若无其事的用日语说一些冒犯学生的话等等...这些放在其他语校都属于足够专门写一条1星差评级别的“恶行”，对我来说却已经算是该校所有离谱行为中杀伤力最低的一项了。\n\n然而，即便是这所奇葩语校把语校成绩和升学率看的比命还重要的情况下，他们所做的也仅仅只是给学生施压，并没提供任何有质量的教学。他们自己教学内容和其他任何一所混签证的语校无异，进度奇慢无比，每次换新学期，新教材，先把以前教过的东西复习半个月甚至一个月都是常态中的常态。而学期末，课本上那本就少得可怜的内容在被强行拿来填充三四个月教学时长的情况下，可怜的小课本再怎么坚持也坚持不下去了的时候，学校就会开始密集安排大量考试，一周五天，其中有考试的差不多要占三四天，并且周五的时候极高概率会安排把这带学生去各种动物园/星云馆/防灾馆的地方进行“自费体验”的“课外活动”，门票和路费全自费，不去就扣出勤率。和其他语校唯一的区别只有多发了一本让学生自己拿来记录自己出勤率的“手账”，据他们所说那么做目的是“让学生看到自己有多努力”....😓\n\n说真的，老早之前我就感觉有点绷不住了，之所以现在才发这个帖子，原因除了上个月的黄毛在离我不足三米远的位置闹出来了个大的之外，直接原因是，现在学校里老师要随便扣学生出勤率的情况似乎又要变本加厉了...\n\n光目前老师提到过的就有两条：\n\n“上课碰手机就算缺勤”\n\n“考试的时候不好好考会算缺勤（看手机直接缺勤，甚至喝水/提前交卷再玩手机/在长达20分钟的考试期间内主动说我不要分了我去接个电话/上个厕所，都有可能直接算你缺勤，而正常只是会被算零分）”\n\n以前虽然经常拿出勤率威胁学生，但是实际违规扣出勤率只是很偶尔才会有，但这次似乎不再只是老师随口一提，而是连校方领导也已经在经过考量后认同了这种做法，从今往后，过去的所有口头威胁说不定都要变成真实存在的了了。\n\n再往下如此发展下去，很可能上课老师问问题的时候你没答，甚至老师叫你的时候你走神了没注意没理老师，都有可能算你一节课缺席或者迟到，用这种滥用职权违规扣除的出勤率强行压迫学生。\n\n不管是学生和语校签的合同，还是入管那边有关的法律，都要求语校“如实记录和上报学生的出勤率”，因为学生不在乎语校成绩就把出席了的学生强行算为没出席属于“谎报”行为，但是假如真到上法庭的时候，学生100%讨不到一丁点好，最最好的结果也无非是花了大把的钱和时间之后最好的情况只是把本来就属于自己的出勤率给要了回去罢了。\n\n在这种情况下，有什么好的对应方法吗？\n\n难道真的只能24小时举着手机录像，然后等着更新签证的时候把几十个g的出勤录像拿给入管看来“申冤”了吗？🫠\n\n-----\n\n最新商谈结果，京进说：我们京进的校规里有一条叫“服从老师指示”，所以我们说你缺席就算缺席，我们有“制定任意规则的权利”。\n\n并且，假如我拍摄“我自己确实在指定时间参加了授课和考试”的视频，即便我不上传，也没任何拍摄教学内容，只要我在上课时间拍就是违反他们校规，按照他们的校规也可以开除我😅\n\n他们自己渎职谎报学生出勤率，校规里还一大堆模糊不清的霸王条款连学生自己保存证据的路都堵死了，都这个b样了真没违法吗？😅😅😅","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"runtoJapan","subreddit_id":"t5_7eixzl","subreddit_name_prefixed":"r/runtoJapan","subreddit_subscribers":21729,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"语校谎报出勤率有什么办法应对吗？","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":60,"upvote_ratio":0.9399999976158142,"url":"https://www.reddit.com/r/runtoJapan/comments/1inni84/语校谎报出勤率有什么办法应对吗/","user_reports":[],"view_count":null,"visited":false,"wls":6}
