{"_meta":{"retrieved_2nd_on":1758077279},"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"[deleted]","author_flair_background_color":"","author_flair_css_class":null,"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":"dark","author_is_blocked":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1757947670,"created_utc":1757947670,"crosspost_parent":"t3_1ndjs3p","crosspost_parent_list":[{"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"thinkbee","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_cg19f","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":false,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1757523422,"created_utc":1757523422,"discussion_type":null,"distinguished":null,"domain":"on.ft.com","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1ndjs3p","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"likes":null,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1ndjs3p","no_follow":false,"num_comments":210,"num_crossposts":2,"num_reports":null,"over_18":false,"permalink":"/r/japan/comments/1ndjs3p/how_tokyo_became_an_unexpected_haven_for_chinas/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM","resolutions":[{"height":60,"url":"https://external-preview.redd.it/k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM.jpeg?width=108&crop=smart&auto=webp&s=1760371a83d050e7db556a2c3003b4f34ad3fb22","width":108},{"height":121,"url":"https://external-preview.redd.it/k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM.jpeg?width=216&crop=smart&auto=webp&s=04d09764faa88c98b6ae6ecaa52d8b1554ed6871","width":216},{"height":180,"url":"https://external-preview.redd.it/k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM.jpeg?width=320&crop=smart&auto=webp&s=5afb417a2a63338fefef914f3b4201a1f99e4ea0","width":320},{"height":360,"url":"https://external-preview.redd.it/k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM.jpeg?width=640&crop=smart&auto=webp&s=15f82a2933e404c2463131c9500ac0f0b5fb5acd","width":640}],"source":{"height":394,"url":"https://external-preview.redd.it/k8ivpEboiUD4geVmmojp4IxWBDMPYJ_7h4YFuIy2rLM.jpeg?auto=webp&s=5e2e295ffc35e2848345a19a04089111b7140b2e","width":700},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"saved":false,"score":802,"secure_media":null,"secure_media_embed":{},"selftext":"I found this article to be incredibly enlightening and something I hadn't considered in terms of China's immigration patterns to Japan over the years. Thoughts?\n\nFor those who don't have access (if the gift link expires), here's a slightly abbreviated version (posting the full article is against FT T&Cs):\n\n*Placing her teacup on the lacquered table, a chic Tokyo-ite turns towards the café’s open window to absorb the beauty of a July day in the Japanese capital. Outside, the leaves on the avenue of ginkgo trees are a rich summer green; the early afternoon sun thrums down on Ueno Park. Crowds wander towards the country’s oldest national museum.*\n\n*“I so, so love this city. But, over the past few months, I have started to change the route I take when walking through my neighbourhood,” she confesses. “I use smaller streets — the ones the Chinese don’t use. There are too many Chinese around these days. I keep hearing Chinese being spoken everywhere. That wasn’t why I left.”*\n\n*The problem was less acute 18 months ago, when the former business executive, who asks to be referred to as Cao, brought her children from China to start a new life in Tokyo. She had planned her move before China’s middle classes had begun looking at Japan with migratory eyes, before dozens of real-estate influencers on RedNote and other social media had begun fizzing about the opportunities of property ownership in Bunkyo, the Tokyo district where she now lives.*\n\n*Cao reckons that, in early 2024, there were just three Chinese families, including her own, in her apartment building. Now there are 11, and her observations of furniture deliveries and the language spoken in the lifts suggest more are on the way. A new Chinese community is forming, she says, with the same jealousies and obsessions she left home to avoid. Cao is now plotting a second move to a part of the city with fewer Chinese.*\n\n*Despite her misgivings about it, Cao is unavoidably a member of this burgeoning diaspora. She is Run-ri: the label given to the wave of middle-class Chinese who have moved to Japan for a lifestyle they see as impossible back home. Some Run-ri want permanent residency in Japan, and the ability to travel back to China for business. Many arrive with no intention of ever returning. Cao says she is here to assimilate, but cannot guess how many of the other Run-ri are.*\n\n*It’s a phenomenon few saw coming, either in Japan or China. Back in Shanghai and other big Chinese cities, according to more than 20 Chinese residents of Tokyo interviewed by the Financial Times, dinner party conversations are dominated by the mechanics of how to get to Tokyo or Osaka — and stay there.*\n\n*There is a code at these dinners, which signals a desire to turn the conversation to the topic, according to another Run-ri, Zhang Jieping, a Tokyo-based journalist and entrepreneur who has founded a Chinese bookstore in the city. The way to do it is to ask one’s fellow diners: “How long do you plan to stay?”*\n\n*“That signals that you want to talk about visas,” Zhang says. “The conversation is always about emigration. Of every three-hour dinner, two will be spent talking about other countries’ visa requirements, how to get out, how to marry a local, how to get an apartment, how to get your parents over there and how to get cash out. Every dinner, every lunch. And everyone talks about Japan.”*\n\n*In these conversations, there is a tacit admission that, for all its “lost” economic decades and flagging dynamism, Japan has got a great deal right. It ranks highly on global indices of peace, economic freedom and property rights. In politics, the nation has kept its poise as others have thrown tantrums, remained supple as others stiffened. It has reliable medical provision, free speech, safe streets, incredible service and astonishingly good food. Beyond these practicalities, there is an almost ideological element to the movement, says Zhang. “The Chinese mindset for the past 30 years has been that leaving is always better. You leave the country for the town. You leave the town for the city. You leave the city for a big city. You leave the big city for the US. Now, you leave for Tokyo.”*\n\n*By making their move at this particular moment in history, the Run-ri are shaping the coming decades of Japan’s demographic, social and perhaps even political destiny. Some economists speculate that we are watching the early phases of the country’s ascent to an “immigration superpower”. They are hopeful for an injection of entrepreneurial energy that will prove invaluable in ageing, shrinking Japan. Others sense trouble ahead, as Chinese buyers propel Tokyo property prices beyond the reach of many Japanese. The government has been pushed to tighten the requirements for the “business manager” visas on which so many Chinese secure their residencies. Some predict a full nationalist backlash, pointing to the klaxons of xenophobia audible in July’s upper-house election campaigns. Because Tokyo is not just a magnet for people wishing to leave China, but for Chinese money too. As well as those seeking a new life, there are some who simply see the city as a financial investment and plan to keep a foot in China for as long as possible.*\n\n*For now, though, the Run-ri have endowed Tokyo with a status it never expected and is largely at a loss to quantify. Whether it is the intellectuals sniping at Beijing from the safety of Jimbocho coffee shops, the more cash-constrained middle classes finding apartments in areas near good local schools, the richer arrivals steadily occupying more of Tokyo’s prime waterfront, or the very wealthiest establishing roots in the swish “3A” districts of Azabu, Aoyama and Akasaka, the Japanese capital is being recast as a Chinese haven.*\n\n*The word Run-ri — broadly used to cover the middle-class entrepreneurs, white-collar workers, wealthier academics, retirees and intellectuals moving to Japan for aspirational reasons — combines two Chinese characters. The run primarily means liquidity or prosperity, but its similarity in sound to the English word “run” also conveys the idea of flight. The second character, ri, is the first in the Chinese word for Japan. The term has been around for a few years, but it has jostled into the mainstream lexicon since about 2022, the peak of the Shanghai Covid-19 lockdowns and, for many cosmopolitan Chinese, a psychological tipping-point: the “life inflection point”, as many describe it.*\n\n*The numbers are startling. Without ever having declared any kind of open-door policy on immigration, Japan has quietly addressed both its demographic decline and worker shortage by allowing its non-Japanese population to surge to about 3.5 million, or just under 3 per cent of the population. The number of foreign residents rose by an average of roughly 1,000 per day over the course of 2024, of which about 10 per cent were Chinese. By next year, according to some projections, the total Chinese population of Japan is likely to hit a million.*\n\n*The Run-ri tend to have certain things in common: relative wealth, an obsession with education, a faith in Tokyo real estate as a store of value — and aspirations to own a seven-seater Toyota Alphard.*\n\n*“Yes, I am Run-ri. I think I fit many of the descriptions,” agreed a 41-year-old IT engineer who left Shenzhen in 2022 and was dropping his son off at an after-hours tutorial school near Toyosu station when approached by the FT. The school is one of many in pockets of Tokyo where Chinese represent more than 10 per cent of the student cohort. There has also been a surge of Chinese enquiries for places in Tokyo’s international schools, to as much as 60 per cent of the total in some cases.*\n\n*The engineer’s apartment is nearby in the Branz tower, a huge block of high-end flats overlooking Tokyo Bay, of which about 20 per cent are believed to have been sold to people with Chinese names, according to local estate agents. A listing for a three-bedroom flat in a nearby tower displayed in the window of a Chinese-owned estate agent in Roppongi had an asking price of ¥350mn ($2.4mn). Other newly built developments nearby, including a vast complex built as the athletes’ village for the Tokyo 2020 Olympics, have similar ratios of Chinese buyers.*\n\n*“My wife and I wanted a city life, and we thought we had that in Shenzhen. But during the pandemic, and maybe before that, we saw a more scary side of China,” the engineer said. “A state that knew it could do anything it wanted, and no longer seemed interested in protecting the middle class. It was difficult to leave our home, but also easy to start a new one here.”*\n\n*For many Chinese, the first proper encounter with Japan and Japanese people is as tourists. Some seven million visited Japan from mainland China last year. Often, these visits dispel negative images of Japan that have been established over decades.*\n\n*Cao first came to Tokyo in 2017 on a business trip for the trading company she was working for, and she quickly fell for the city. “I had decided by the following year that I wanted to move here. I liked the calmer atmosphere. Even when places are crowded, they feel calm here.”*\n\n*She homed in on Bunkyo ward for its reputation as the educational heart of the Japanese capital. A single mother of two, Cao has stretched herself financially to make a life for her family in Tokyo, and the state-run schools and private crammers in the area have a reputation for quality. There are some local government subsidies for residents on tight budgets, and children who arrive in the local public schools in Bunkyo not speaking Japanese as their first language are offered a certain number of extra Japanese language lessons.*\n\n*Meanwhile, Japan’s schools are emptying. In 2016, the number of Japanese babies born fell below one million for the first time since records began in 1899. By 2024, the number was just 686,000. In rural Japan, that has meant a steady beat of school closures, but in the middle of Tokyo it means there are places available. The effect has been striking.*\n\n*Very quickly, Cao found herself pulled into an educational arms race with other Chinese parents. “The middle class? They are super, super competitive, and that is a big part of what they want here,” says Cao, opening her phone to reveal a school chat group of Chinese parents. It is a cavalcade of paranoia and passive aggression. “Should the kids go to a private or a public school? Should they do this particular exam? Is that school good? Is that teacher intelligent enough? What scores did everyone get? It’s not what I wanted,” she says.*\n\n*As the Chinese community in Bunkyo has expanded, the children have begun to group together and do not speak Japanese outside school, she says. Within school, it is already becoming a distraction. “A lot of Chinese like to be in that environment, but I do not,” says Cao, who prefers not to be too explicit about where she plans to move next for fear that other Run-ri will follow.*\n\n*Many thousands of Chinese leave their country every year — for the US, Canada, Australia, Europe or other parts of Asia. Historically, China produced a large flow of emigrants with almost no assets. More recently, it has become a world leader in the export of high-net-worth individuals (those with liquid assets over $1mn), with an estimated 12,500 departing in 2024.*\n\n*Economic instability and tightening authoritarianism at home is now producing a third category of leavers: middle-class Chinese headed for what might be described as the Bolt-hole of the Rising Sun, just a three-hour flight from Shanghai. At the same time, President Donald Trump and his Maga movement have caused many would-be Chinese emigrants to cross the US off their preferred-destination lists. A small but growing number of Chinese, known as the Er-run (“second runners”), who moved to the US years or even decades ago, are also jumping ship again — to Japan.*\n\n*Despite Tokyo’s vulnerability to regional tensions, trade wars and natural disasters, the city seems to suit an era of globalised uncertainty. A chronically weak yen makes everything seem cheap to those with foreign assets. And, for now at least, Japan makes it relatively easy for incomers to obtain a visa as a highly skilled professional or business owner. Setting up a company of a type that supports at least one business manager visa requires roughly $35,000 of capital and a further $5,000–$10,000 of administrative fees, according to several lawyers. Plans have been mooted by the government to significantly expand the minimum required capital.*\n\n*Was it any coincidence that Alibaba founder Jack Ma chose to move to Tokyo, of all possible cities, when he fell out of favour with Beijing in late 2021? “Of course it was not,” says one close Japanese acquaintance of the billionaire, who used to meet Ma regularly at a Chinese-owned private members’ club in the city. “What is far more fascinating is that the same calculations now make perfect sense to those with only a minuscule fraction of Ma’s fortune.”*\n\n*Ma was followed to Tokyo by others from China’s business elite, a trend that only added to its aspirational allure. Occasional sightings of Chinese tech founders walking nonchalantly around Nogizaka or Ginza in casual clothes have become fodder for Chinese social media as well as right-of-centre Japanese outlets harrumphing that no good will come of this migratory tsunami.*\n\n*But it is the more modest incoming Chinese wealth that demands the most scrutiny, says Takehiro Masutomo, an academic and journalist whose book Run Ri was published in January. The book (available only in Japanese) is the first serious probe of the Run-ri phenomenon as a socio-economic force, and continues to sell strongly. Even without Masutomo’s work — which notes ski resorts, forests, sake breweries, hotels, restaurants and other businesses being cornered by incoming Chinese buyers — it is becoming impossible to ignore what is happening. The total size of the Chinese population in Japan was about 200,000 in 1995. It rose through the early 2000s, and settled at roughly 700,000 between 2010 and 2021. Since then, though, the numbers have soared.*\n\n*Masutomo estimates about 100,000 immigrants fit the definition of Run-ri. He notes distinct waves: between the early 1980s and early 2010s, settlers were often from Fujian and China’s north-east, and lived mostly in rural Japan or cheaper suburbs of Tokyo and Osaka. They were mainly trainees or students, had few assets, could speak Japanese and were pro-Beijing. A much larger proportion of today’s arrivals, meanwhile, come from Tier-1 Chinese cities, live in the central wards of big metropolises, have sizable financial assets, are not fluent in Japanese and have little affection for the Xi Jinping regime.*\n\n*A Shanghai native who used to work in online media and who asked to be known as James is one of those preparing to leave. James’s wife will move to Japan on a highly skilled professional visa, and he will follow. They are just weeks away from becoming Run-ri. After extensive research, James fixed on Urawa, a suburb about 70 minutes from central Tokyo, as the place to live. The property is relatively cheap and the public education is good, he says. But underlying all his decisions is something else: “In the past, it was always about America. Nobody wants to go to the US now. Not with Trump. A lot of us have membership of the Chinese Communist party, just because that was what we needed to do to get ahead in business. So now, with that membership, you are afraid you’ll probably be denied a \\[US\\] visa.”*\n\n*Tokyo feels politically safer. “I don’t know who will win between the US and China, but Japan is in the middle. Japan is a good place to set up my second life,” says James. “Japan is stable. It has rational politics. It has no Chinese nationalists. No Maga. It just has a normal society. And I think that the number of people \\[in Shanghai\\] who share this kind of thinking is on the rise. Everyone has a third term for Trump or a fourth term for Xi in their mind, and they don’t like it.”*\n\n*Once the Run-ri decide to leave China, they confront a series of practical obstacles and financial risks. A parallel service industry of Chinese and Japanese entrepreneurs has emerged to solve these problems. At least one private hospital in central Tokyo has renovated entire floors to cater to wealthy foreigners, assuming most will be Chinese. Japan’s biggest investment banks have expanded domestic services to target the wealthiest Run-ri. Some of Japan’s best sushi and teppanyaki chefs, said two restaurateurs, have vanished behind the doors of private clubs built principally for Chinese clients. Ambition DX, a Tokyo-listed real-estate brokerage, explicitly advertises itself as an expert in catering to the Run-ri boom.*\n\n*Alex Hayashi, founder of Compass Capital, a consulting firm started in Tokyo in 2019, suggests that few in Japan — whether in finance or government — grasp how unlike any previous wave of immigration this influx is. “Why are there so many Chinese entrepreneurs here? Because they feel they have no other options,” he said. “In the past, people trying to get out of China would head for Singapore, but it’s too small, there are not enough investment opportunities. There was a previous wave of Hongkongers wanting to move to Tokyo, but they weren’t looking for double-digit investment returns like the new generation of Chinese do.”*\n\n*The most tangible impact has been on property prices in Tokyo — an issue over which populist Japanese politicians have stoked anger. Prices of higher-end apartments in the capital, and land in central wards for low-rise houses, have risen significantly since 2022. Masutomo says the influx is jarring for Japanese. For more than 60 years, since it became a developed nation, Japan thought of itself as the richest and most sophisticated country in Asia. That idea is now being challenged by wealthy colonists, particularly humiliating because of the weakness of the yen.*\n\n*“I think this is the first time that Japan has really confronted richer and more sophisticated immigrants from Asia,” says Masutomo. “It is making Japanese people feel poor in their own country.”*\n\n*A sporty man in his thirties, who asks to be known as Guo, meets me in a busy café in Nakano — a lively, shabby warren of often Chinese-owned restaurants and bars. Guo moved with his wife from Beijing to Tokyo in 2022. They obtained working visas in about four months, he says. Many of their friends are also in Tokyo on business manager visas. To qualify, they either set up companies or bought small, failing Japanese businesses on the cheap.*\n\n*Guo works for one of what he reckons are about 50 Chinese-staffed real-estate agents catering to other Chinese. Many of his colleagues left or were cut from big Chinese tech companies such as Tencent, Baidu, Alibaba and Meituan. Some went to Rakuten or Japanese travel firms. “We get 200 enquiries every month, and perhaps a deal or two every week. There is an urgency in their buying, because they have seen property prices collapse in China and they see Tokyo as a place where property values will hold,” Guo says.*\n\n*About half of the deals are made by Chinese who intend to live in the properties. They have specific requirements: enough floorspace to bring elderly relatives from China or host visitors, and — very importantly — a parking space big enough for a Toyota Alphard. A new Alphard costs the equivalent of $130,000 in China and carries huge status. In Japan, the same car costs about $40,000. “They have seen celebrities in China being driven around in them. They want to buy all of that prestige but for a really low price in yen.”*\n\n*When Guo and his wife arrived in Tokyo, they faced the usual problems. Very rich Chinese can set up bank accounts or paper companies in Singapore and Hong Kong to remit funds into Japan. But for most Run-ri, says Guo, opening a Japanese bank account, getting savings out of China or even renting a flat is a challenge. An extensive underground banking system has emerged to circumvent China’s restrictions on capital flows. Guo and three others estimate that about 70 per cent of Tokyo-based property transactions by Chinese buyers involve one of these underground banks.*\n\n*It works like this: the banks convert renminbi into yen via a complex network of laundering facilities that include dollar-generating Chinese import businesses in Africa. The customer delivers funds to a representative of the bank in China, then arranges to receive yen at various locations in Japanese cities. Cash is couriered in huge quantities — one agent said a North Face waterproof rucksack is the favoured receptacle — with the underground bankers taking as much as a 100 basis point margin on each transaction. A million dollars’ worth of renminbi can be converted into yen in about a day. “It has to be very discreet. A lot of the customers are the families of Chinese government officials,” says Guo.*\n\n*The “accidental” founder of several Chinese bookstores, Zhang Jieping, was born in Wuxi and moved to Tokyo in 2024. Leading me from a café near Koenji station through side streets, she shows me her shop, Nowhere Party. Inside, the apartment has been converted into a small, elegantly congested bookshop selling commentary and criticism that cannot appear on shelves in Xi’s China.*\n\n*Zhang’s shop, which opened this year, doubles as a space for lectures, book clubs and discussion groups. It is one of four Chinese bookstores to open in Tokyo in the past three years, alongside Daxiangjie (One Way Street) and Juwairen (The Stranger). Zhang, a journalist for more than a decade, had previously opened bookshops in Taipei, Chiang Mai and The Hague. “A bookshop owner follows people’s demands. One role is as a business owner, the other is as an observer of communities. It’s like a window.”*\n\n*About 60 per cent of her Tokyo customers are from mainland China. Some of the books she sells are banned outright there; others are simply unavailable. While there is interest in “juicy topics” like direct criticism of Xi, Zhang says Run-ri in Tokyo are increasingly more interested in broader geopolitical reading.*\n\n*Masutomo agrees. By mid-2024, he noticed an “intellectual flight” to Tokyo: older Chinese, including academics, moving to the suburbs. “I don’t think they are trying to start a revolution from here, but it is interesting. The steady opening of bookshops and the concentration of Chinese intellectuals is quite unique. I don’t know other major cities where that happens apart from Tokyo.”*\n\n*He argues that the simultaneous integration of Chinese wealth and Chinese intellectuals will be key over the coming decade. “If they combine in a meaningful way, that will become political and they might be monitored more seriously by the CCP,” he says.*\n\n*One such dissident is Jia Jia, in his forties, who came on a visiting scholarship to the University of Tokyo. His main outlet is YouTube debates with other Chinese intellectuals. Before fleeing with his wife, Jia was detained by Chinese authorities under suspicion of involvement in an open letter calling on Xi to resign. Released but still under scrutiny, he left for Japan.*\n\n*“I don’t think I’m like most of the other Chinese who have come to Tokyo,” Jia says. “I was chased by the police. I am like a dissident. What has made me most happy has been coming to Tokyo. Here I sleep comfortably at night. I live without fear.”*\n\n*But he admits Tokyo has changed him. The haven has softened his edges. His writing has slowed, and he has begun to appreciate peace. “Some Chinese seek to find China in Japan,” he says. “Others try to change the course of China from Japan. A third group just tries to forget about China as soon as they arrive.”*\n\n*While that may capture how many Run-ri see Tokyo, there is no such neat summary of how Tokyo views them. The newcomers are a reminder that the city’s greatest asset is its capacity for reinvention, reconstruction and reimagining. Those powers have already been tested by war, natural disasters and economic catastrophe. The odds that it can manage immigration are good.*","selftext_html":"<!-- SC_OFF --><div class=\"md\"><p>I found this article to be incredibly enlightening and something I hadn&#39;t considered in terms of China&#39;s immigration patterns to Japan over the years. Thoughts?</p>\n\n<p>For those who don&#39;t have access (if the gift link expires), here&#39;s a slightly abbreviated version (posting the full article is against FT T&amp;Cs):</p>\n\n<p><em>Placing her teacup on the lacquered table, a chic Tokyo-ite turns towards the café’s open window to absorb the beauty of a July day in the Japanese capital. Outside, the leaves on the avenue of ginkgo trees are a rich summer green; the early afternoon sun thrums down on Ueno Park. Crowds wander towards the country’s oldest national museum.</em></p>\n\n<p><em>“I so, so love this city. But, over the past few months, I have started to change the route I take when walking through my neighbourhood,” she confesses. “I use smaller streets — the ones the Chinese don’t use. There are too many Chinese around these days. I keep hearing Chinese being spoken everywhere. That wasn’t why I left.”</em></p>\n\n<p><em>The problem was less acute 18 months ago, when the former business executive, who asks to be referred to as Cao, brought her children from China to start a new life in Tokyo. She had planned her move before China’s middle classes had begun looking at Japan with migratory eyes, before dozens of real-estate influencers on RedNote and other social media had begun fizzing about the opportunities of property ownership in Bunkyo, the Tokyo district where she now lives.</em></p>\n\n<p><em>Cao reckons that, in early 2024, there were just three Chinese families, including her own, in her apartment building. Now there are 11, and her observations of furniture deliveries and the language spoken in the lifts suggest more are on the way. A new Chinese community is forming, she says, with the same jealousies and obsessions she left home to avoid. Cao is now plotting a second move to a part of the city with fewer Chinese.</em></p>\n\n<p><em>Despite her misgivings about it, Cao is unavoidably a member of this burgeoning diaspora. She is Run-ri: the label given to the wave of middle-class Chinese who have moved to Japan for a lifestyle they see as impossible back home. Some Run-ri want permanent residency in Japan, and the ability to travel back to China for business. Many arrive with no intention of ever returning. Cao says she is here to assimilate, but cannot guess how many of the other Run-ri are.</em></p>\n\n<p><em>It’s a phenomenon few saw coming, either in Japan or China. Back in Shanghai and other big Chinese cities, according to more than 20 Chinese residents of Tokyo interviewed by the Financial Times, dinner party conversations are dominated by the mechanics of how to get to Tokyo or Osaka — and stay there.</em></p>\n\n<p><em>There is a code at these dinners, which signals a desire to turn the conversation to the topic, according to another Run-ri, Zhang Jieping, a Tokyo-based journalist and entrepreneur who has founded a Chinese bookstore in the city. The way to do it is to ask one’s fellow diners: “How long do you plan to stay?”</em></p>\n\n<p><em>“That signals that you want to talk about visas,” Zhang says. “The conversation is always about emigration. Of every three-hour dinner, two will be spent talking about other countries’ visa requirements, how to get out, how to marry a local, how to get an apartment, how to get your parents over there and how to get cash out. Every dinner, every lunch. And everyone talks about Japan.”</em></p>\n\n<p><em>In these conversations, there is a tacit admission that, for all its “lost” economic decades and flagging dynamism, Japan has got a great deal right. It ranks highly on global indices of peace, economic freedom and property rights. In politics, the nation has kept its poise as others have thrown tantrums, remained supple as others stiffened. It has reliable medical provision, free speech, safe streets, incredible service and astonishingly good food. Beyond these practicalities, there is an almost ideological element to the movement, says Zhang. “The Chinese mindset for the past 30 years has been that leaving is always better. You leave the country for the town. You leave the town for the city. You leave the city for a big city. You leave the big city for the US. Now, you leave for Tokyo.”</em></p>\n\n<p><em>By making their move at this particular moment in history, the Run-ri are shaping the coming decades of Japan’s demographic, social and perhaps even political destiny. Some economists speculate that we are watching the early phases of the country’s ascent to an “immigration superpower”. They are hopeful for an injection of entrepreneurial energy that will prove invaluable in ageing, shrinking Japan. Others sense trouble ahead, as Chinese buyers propel Tokyo property prices beyond the reach of many Japanese. The government has been pushed to tighten the requirements for the “business manager” visas on which so many Chinese secure their residencies. Some predict a full nationalist backlash, pointing to the klaxons of xenophobia audible in July’s upper-house election campaigns. Because Tokyo is not just a magnet for people wishing to leave China, but for Chinese money too. As well as those seeking a new life, there are some who simply see the city as a financial investment and plan to keep a foot in China for as long as possible.</em></p>\n\n<p><em>For now, though, the Run-ri have endowed Tokyo with a status it never expected and is largely at a loss to quantify. Whether it is the intellectuals sniping at Beijing from the safety of Jimbocho coffee shops, the more cash-constrained middle classes finding apartments in areas near good local schools, the richer arrivals steadily occupying more of Tokyo’s prime waterfront, or the very wealthiest establishing roots in the swish “3A” districts of Azabu, Aoyama and Akasaka, the Japanese capital is being recast as a Chinese haven.</em></p>\n\n<p><em>The word Run-ri — broadly used to cover the middle-class entrepreneurs, white-collar workers, wealthier academics, retirees and intellectuals moving to Japan for aspirational reasons — combines two Chinese characters. The run primarily means liquidity or prosperity, but its similarity in sound to the English word “run” also conveys the idea of flight. The second character, ri, is the first in the Chinese word for Japan. The term has been around for a few years, but it has jostled into the mainstream lexicon since about 2022, the peak of the Shanghai Covid-19 lockdowns and, for many cosmopolitan Chinese, a psychological tipping-point: the “life inflection point”, as many describe it.</em></p>\n\n<p><em>The numbers are startling. Without ever having declared any kind of open-door policy on immigration, Japan has quietly addressed both its demographic decline and worker shortage by allowing its non-Japanese population to surge to about 3.5 million, or just under 3 per cent of the population. The number of foreign residents rose by an average of roughly 1,000 per day over the course of 2024, of which about 10 per cent were Chinese. By next year, according to some projections, the total Chinese population of Japan is likely to hit a million.</em></p>\n\n<p><em>The Run-ri tend to have certain things in common: relative wealth, an obsession with education, a faith in Tokyo real estate as a store of value — and aspirations to own a seven-seater Toyota Alphard.</em></p>\n\n<p><em>“Yes, I am Run-ri. I think I fit many of the descriptions,” agreed a 41-year-old IT engineer who left Shenzhen in 2022 and was dropping his son off at an after-hours tutorial school near Toyosu station when approached by the FT. The school is one of many in pockets of Tokyo where Chinese represent more than 10 per cent of the student cohort. There has also been a surge of Chinese enquiries for places in Tokyo’s international schools, to as much as 60 per cent of the total in some cases.</em></p>\n\n<p><em>The engineer’s apartment is nearby in the Branz tower, a huge block of high-end flats overlooking Tokyo Bay, of which about 20 per cent are believed to have been sold to people with Chinese names, according to local estate agents. A listing for a three-bedroom flat in a nearby tower displayed in the window of a Chinese-owned estate agent in Roppongi had an asking price of ¥350mn ($2.4mn). Other newly built developments nearby, including a vast complex built as the athletes’ village for the Tokyo 2020 Olympics, have similar ratios of Chinese buyers.</em></p>\n\n<p><em>“My wife and I wanted a city life, and we thought we had that in Shenzhen. But during the pandemic, and maybe before that, we saw a more scary side of China,” the engineer said. “A state that knew it could do anything it wanted, and no longer seemed interested in protecting the middle class. It was difficult to leave our home, but also easy to start a new one here.”</em></p>\n\n<p><em>For many Chinese, the first proper encounter with Japan and Japanese people is as tourists. Some seven million visited Japan from mainland China last year. Often, these visits dispel negative images of Japan that have been established over decades.</em></p>\n\n<p><em>Cao first came to Tokyo in 2017 on a business trip for the trading company she was working for, and she quickly fell for the city. “I had decided by the following year that I wanted to move here. I liked the calmer atmosphere. Even when places are crowded, they feel calm here.”</em></p>\n\n<p><em>She homed in on Bunkyo ward for its reputation as the educational heart of the Japanese capital. A single mother of two, Cao has stretched herself financially to make a life for her family in Tokyo, and the state-run schools and private crammers in the area have a reputation for quality. There are some local government subsidies for residents on tight budgets, and children who arrive in the local public schools in Bunkyo not speaking Japanese as their first language are offered a certain number of extra Japanese language lessons.</em></p>\n\n<p><em>Meanwhile, Japan’s schools are emptying. In 2016, the number of Japanese babies born fell below one million for the first time since records began in 1899. By 2024, the number was just 686,000. In rural Japan, that has meant a steady beat of school closures, but in the middle of Tokyo it means there are places available. The effect has been striking.</em></p>\n\n<p><em>Very quickly, Cao found herself pulled into an educational arms race with other Chinese parents. “The middle class? They are super, super competitive, and that is a big part of what they want here,” says Cao, opening her phone to reveal a school chat group of Chinese parents. It is a cavalcade of paranoia and passive aggression. “Should the kids go to a private or a public school? Should they do this particular exam? Is that school good? Is that teacher intelligent enough? What scores did everyone get? It’s not what I wanted,” she says.</em></p>\n\n<p><em>As the Chinese community in Bunkyo has expanded, the children have begun to group together and do not speak Japanese outside school, she says. Within school, it is already becoming a distraction. “A lot of Chinese like to be in that environment, but I do not,” says Cao, who prefers not to be too explicit about where she plans to move next for fear that other Run-ri will follow.</em></p>\n\n<p><em>Many thousands of Chinese leave their country every year — for the US, Canada, Australia, Europe or other parts of Asia. Historically, China produced a large flow of emigrants with almost no assets. More recently, it has become a world leader in the export of high-net-worth individuals (those with liquid assets over $1mn), with an estimated 12,500 departing in 2024.</em></p>\n\n<p><em>Economic instability and tightening authoritarianism at home is now producing a third category of leavers: middle-class Chinese headed for what might be described as the Bolt-hole of the Rising Sun, just a three-hour flight from Shanghai. At the same time, President Donald Trump and his Maga movement have caused many would-be Chinese emigrants to cross the US off their preferred-destination lists. A small but growing number of Chinese, known as the Er-run (“second runners”), who moved to the US years or even decades ago, are also jumping ship again — to Japan.</em></p>\n\n<p><em>Despite Tokyo’s vulnerability to regional tensions, trade wars and natural disasters, the city seems to suit an era of globalised uncertainty. A chronically weak yen makes everything seem cheap to those with foreign assets. And, for now at least, Japan makes it relatively easy for incomers to obtain a visa as a highly skilled professional or business owner. Setting up a company of a type that supports at least one business manager visa requires roughly $35,000 of capital and a further $5,000–$10,000 of administrative fees, according to several lawyers. Plans have been mooted by the government to significantly expand the minimum required capital.</em></p>\n\n<p><em>Was it any coincidence that Alibaba founder Jack Ma chose to move to Tokyo, of all possible cities, when he fell out of favour with Beijing in late 2021? “Of course it was not,” says one close Japanese acquaintance of the billionaire, who used to meet Ma regularly at a Chinese-owned private members’ club in the city. “What is far more fascinating is that the same calculations now make perfect sense to those with only a minuscule fraction of Ma’s fortune.”</em></p>\n\n<p><em>Ma was followed to Tokyo by others from China’s business elite, a trend that only added to its aspirational allure. Occasional sightings of Chinese tech founders walking nonchalantly around Nogizaka or Ginza in casual clothes have become fodder for Chinese social media as well as right-of-centre Japanese outlets harrumphing that no good will come of this migratory tsunami.</em></p>\n\n<p><em>But it is the more modest incoming Chinese wealth that demands the most scrutiny, says Takehiro Masutomo, an academic and journalist whose book Run Ri was published in January. The book (available only in Japanese) is the first serious probe of the Run-ri phenomenon as a socio-economic force, and continues to sell strongly. Even without Masutomo’s work — which notes ski resorts, forests, sake breweries, hotels, restaurants and other businesses being cornered by incoming Chinese buyers — it is becoming impossible to ignore what is happening. The total size of the Chinese population in Japan was about 200,000 in 1995. It rose through the early 2000s, and settled at roughly 700,000 between 2010 and 2021. Since then, though, the numbers have soared.</em></p>\n\n<p><em>Masutomo estimates about 100,000 immigrants fit the definition of Run-ri. He notes distinct waves: between the early 1980s and early 2010s, settlers were often from Fujian and China’s north-east, and lived mostly in rural Japan or cheaper suburbs of Tokyo and Osaka. They were mainly trainees or students, had few assets, could speak Japanese and were pro-Beijing. A much larger proportion of today’s arrivals, meanwhile, come from Tier-1 Chinese cities, live in the central wards of big metropolises, have sizable financial assets, are not fluent in Japanese and have little affection for the Xi Jinping regime.</em></p>\n\n<p><em>A Shanghai native who used to work in online media and who asked to be known as James is one of those preparing to leave. James’s wife will move to Japan on a highly skilled professional visa, and he will follow. They are just weeks away from becoming Run-ri. After extensive research, James fixed on Urawa, a suburb about 70 minutes from central Tokyo, as the place to live. The property is relatively cheap and the public education is good, he says. But underlying all his decisions is something else: “In the past, it was always about America. Nobody wants to go to the US now. Not with Trump. A lot of us have membership of the Chinese Communist party, just because that was what we needed to do to get ahead in business. So now, with that membership, you are afraid you’ll probably be denied a [US] visa.”</em></p>\n\n<p><em>Tokyo feels politically safer. “I don’t know who will win between the US and China, but Japan is in the middle. Japan is a good place to set up my second life,” says James. “Japan is stable. It has rational politics. It has no Chinese nationalists. No Maga. It just has a normal society. And I think that the number of people [in Shanghai] who share this kind of thinking is on the rise. Everyone has a third term for Trump or a fourth term for Xi in their mind, and they don’t like it.”</em></p>\n\n<p><em>Once the Run-ri decide to leave China, they confront a series of practical obstacles and financial risks. A parallel service industry of Chinese and Japanese entrepreneurs has emerged to solve these problems. At least one private hospital in central Tokyo has renovated entire floors to cater to wealthy foreigners, assuming most will be Chinese. Japan’s biggest investment banks have expanded domestic services to target the wealthiest Run-ri. Some of Japan’s best sushi and teppanyaki chefs, said two restaurateurs, have vanished behind the doors of private clubs built principally for Chinese clients. Ambition DX, a Tokyo-listed real-estate brokerage, explicitly advertises itself as an expert in catering to the Run-ri boom.</em></p>\n\n<p><em>Alex Hayashi, founder of Compass Capital, a consulting firm started in Tokyo in 2019, suggests that few in Japan — whether in finance or government — grasp how unlike any previous wave of immigration this influx is. “Why are there so many Chinese entrepreneurs here? Because they feel they have no other options,” he said. “In the past, people trying to get out of China would head for Singapore, but it’s too small, there are not enough investment opportunities. There was a previous wave of Hongkongers wanting to move to Tokyo, but they weren’t looking for double-digit investment returns like the new generation of Chinese do.”</em></p>\n\n<p><em>The most tangible impact has been on property prices in Tokyo — an issue over which populist Japanese politicians have stoked anger. Prices of higher-end apartments in the capital, and land in central wards for low-rise houses, have risen significantly since 2022. Masutomo says the influx is jarring for Japanese. For more than 60 years, since it became a developed nation, Japan thought of itself as the richest and most sophisticated country in Asia. That idea is now being challenged by wealthy colonists, particularly humiliating because of the weakness of the yen.</em></p>\n\n<p><em>“I think this is the first time that Japan has really confronted richer and more sophisticated immigrants from Asia,” says Masutomo. “It is making Japanese people feel poor in their own country.”</em></p>\n\n<p><em>A sporty man in his thirties, who asks to be known as Guo, meets me in a busy café in Nakano — a lively, shabby warren of often Chinese-owned restaurants and bars. Guo moved with his wife from Beijing to Tokyo in 2022. They obtained working visas in about four months, he says. Many of their friends are also in Tokyo on business manager visas. To qualify, they either set up companies or bought small, failing Japanese businesses on the cheap.</em></p>\n\n<p><em>Guo works for one of what he reckons are about 50 Chinese-staffed real-estate agents catering to other Chinese. Many of his colleagues left or were cut from big Chinese tech companies such as Tencent, Baidu, Alibaba and Meituan. Some went to Rakuten or Japanese travel firms. “We get 200 enquiries every month, and perhaps a deal or two every week. There is an urgency in their buying, because they have seen property prices collapse in China and they see Tokyo as a place where property values will hold,” Guo says.</em></p>\n\n<p><em>About half of the deals are made by Chinese who intend to live in the properties. They have specific requirements: enough floorspace to bring elderly relatives from China or host visitors, and — very importantly — a parking space big enough for a Toyota Alphard. A new Alphard costs the equivalent of $130,000 in China and carries huge status. In Japan, the same car costs about $40,000. “They have seen celebrities in China being driven around in them. They want to buy all of that prestige but for a really low price in yen.”</em></p>\n\n<p><em>When Guo and his wife arrived in Tokyo, they faced the usual problems. Very rich Chinese can set up bank accounts or paper companies in Singapore and Hong Kong to remit funds into Japan. But for most Run-ri, says Guo, opening a Japanese bank account, getting savings out of China or even renting a flat is a challenge. An extensive underground banking system has emerged to circumvent China’s restrictions on capital flows. Guo and three others estimate that about 70 per cent of Tokyo-based property transactions by Chinese buyers involve one of these underground banks.</em></p>\n\n<p><em>It works like this: the banks convert renminbi into yen via a complex network of laundering facilities that include dollar-generating Chinese import businesses in Africa. The customer delivers funds to a representative of the bank in China, then arranges to receive yen at various locations in Japanese cities. Cash is couriered in huge quantities — one agent said a North Face waterproof rucksack is the favoured receptacle — with the underground bankers taking as much as a 100 basis point margin on each transaction. A million dollars’ worth of renminbi can be converted into yen in about a day. “It has to be very discreet. A lot of the customers are the families of Chinese government officials,” says Guo.</em></p>\n\n<p><em>The “accidental” founder of several Chinese bookstores, Zhang Jieping, was born in Wuxi and moved to Tokyo in 2024. Leading me from a café near Koenji station through side streets, she shows me her shop, Nowhere Party. Inside, the apartment has been converted into a small, elegantly congested bookshop selling commentary and criticism that cannot appear on shelves in Xi’s China.</em></p>\n\n<p><em>Zhang’s shop, which opened this year, doubles as a space for lectures, book clubs and discussion groups. It is one of four Chinese bookstores to open in Tokyo in the past three years, alongside Daxiangjie (One Way Street) and Juwairen (The Stranger). Zhang, a journalist for more than a decade, had previously opened bookshops in Taipei, Chiang Mai and The Hague. “A bookshop owner follows people’s demands. One role is as a business owner, the other is as an observer of communities. It’s like a window.”</em></p>\n\n<p><em>About 60 per cent of her Tokyo customers are from mainland China. Some of the books she sells are banned outright there; others are simply unavailable. While there is interest in “juicy topics” like direct criticism of Xi, Zhang says Run-ri in Tokyo are increasingly more interested in broader geopolitical reading.</em></p>\n\n<p><em>Masutomo agrees. By mid-2024, he noticed an “intellectual flight” to Tokyo: older Chinese, including academics, moving to the suburbs. “I don’t think they are trying to start a revolution from here, but it is interesting. The steady opening of bookshops and the concentration of Chinese intellectuals is quite unique. I don’t know other major cities where that happens apart from Tokyo.”</em></p>\n\n<p><em>He argues that the simultaneous integration of Chinese wealth and Chinese intellectuals will be key over the coming decade. “If they combine in a meaningful way, that will become political and they might be monitored more seriously by the CCP,” he says.</em></p>\n\n<p><em>One such dissident is Jia Jia, in his forties, who came on a visiting scholarship to the University of Tokyo. His main outlet is YouTube debates with other Chinese intellectuals. Before fleeing with his wife, Jia was detained by Chinese authorities under suspicion of involvement in an open letter calling on Xi to resign. Released but still under scrutiny, he left for Japan.</em></p>\n\n<p><em>“I don’t think I’m like most of the other Chinese who have come to Tokyo,” Jia says. “I was chased by the police. I am like a dissident. What has made me most happy has been coming to Tokyo. Here I sleep comfortably at night. I live without fear.”</em></p>\n\n<p><em>But he admits Tokyo has changed him. The haven has softened his edges. His writing has slowed, and he has begun to appreciate peace. “Some Chinese seek to find China in Japan,” he says. “Others try to change the course of China from Japan. A third group just tries to forget about China as soon as they arrive.”</em></p>\n\n<p><em>While that may capture how many Run-ri see Tokyo, there is no such neat summary of how Tokyo views them. The newcomers are a reminder that the city’s greatest asset is its capacity for reinvention, reconstruction and reimagining. Those powers have already been tested by war, natural disasters and economic catastrophe. The odds that it can manage immigration are good.</em></p>\n</div><!-- SC_ON -->","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"japan","subreddit_id":"t5_2qh2u","subreddit_name_prefixed":"r/japan","subreddit_subscribers":1742366,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":78,"thumbnail_width":140,"title":"How Tokyo became an unexpected haven for China’s middle class","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":802,"upvote_ratio":0.949999988079071,"url":"https://on.ft.com/4nekZgu","url_overridden_by_dest":"https://on.ft.com/4nekZgu","user_reports":[],"view_count":null,"visited":false,"wls":6}],"discussion_type":null,"distinguished":null,"domain":"","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"1nhnvu2","is_created_from_ads_ui":false,"is_crosspostable":false,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":false,"is_self":false,"is_video":false,"likes":null,"link_flair_background_color":"#dadada","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"c675eaf8-4933-11ee-85bc-ee007e56d2c4","link_flair_text":"📰新闻分享","link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_1nhnvu2","no_follow":true,"num_comments":0,"num_crossposts":0,"num_reports":null,"over_18":false,"permalink":"/r/runtoJapan/comments/1nhnvu2/how_tokyo_became_an_unexpected_haven_for_chinas/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":"deleted","report_reasons":null,"retrieved_on":1757947689,"saved":false,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"[deleted]","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"runtoJapan","subreddit_id":"t5_7eixzl","subreddit_name_prefixed":"r/runtoJapan","subreddit_subscribers":36789,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":null,"thumbnail_width":null,"title":"How Tokyo became an unexpected haven for China’s middle class","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"ups":1,"upvote_ratio":1,"url":"","url_overridden_by_dest":"","user_reports":[],"view_count":null,"visited":false,"wls":6}
